Repository: 8ar10der/Alpaca
Catalog: po/*.po
Languages: ar, az

source: Defines the maximum number of tokens (words + spaces) the AI can generate in a response. More tokens allow longer replies but may take more time and cost more.
ar: يُحدِّد الحد الأقصى لعدد الأمَّارات (الكلمات مع الفراغات) التي يمكن للذكاء الاصطناعي توليدها في الرد. يسمح عدد أكبر من الرموز بإجابات أطول، ولكنه قد يستغرق وقتًا أطول ويكلِّف أكثر.

source: Temperature
ar: الحرارة
az: Temperatur

source: Increasing the temperature will make the models answer more creatively.
ar: رَفعُ الحرَّارة سيجعل النماذج تجيب بإبداعية.

source: Seed
ar: البذرة
az: Toxum

source: Setting this to a specific number other than 0 will make the model generate the same text for the same prompt.
ar: تعيين هذا لرقم أعلى من صفر سيجعل النموذج يرد بنفس النص لنفس الطلب.

source: Overrides
ar: التجاوزات

source: These entries are optional, they are used to troubleshoot GPU related problems with Ollama.
ar: هذه المدخلات اختيارية، وتستخدم لتتبع المشاكل المتعلقة بالمعالج الرسوميّ مع أولاما.

source: Model Directory
ar: مجلد النموذج

source: Select Directory
ar: اختر مجلدًا

source: Default Model
ar: النموذج المبدئي

source: Model to select when starting a new chat.
ar: النموذج المبدئي عن بدأ دردشة جديدة.

source: Title Model
ar: نموذج العنوان

source: Model to use when generating a chat title.
ar: النموذج المستخدم عند توليد عنوان الدردشة.

source: Edit Instance
ar: عَدِّل المثيل

source: Instance
ar: مثيل

source: Remove Instance?
ar: أأحذف المثيل؟

source: Are you sure you want to remove this instance?
ar: أمتأكد من رغبتك بحذف هذا المثيل؟

source: Remove
ar: أزِل
az: Sil

source: Selecting tool to use...
ar: يختار الأداة ليستخدمها...

source: Using {}
ar: يستخدم {}

source: Arguments
ar: المُعطيات

source: Tool Error
ar: خطأ في الأداة

source: An error occurred while running tool
ar: حصل خطأ أثناء تشغيل الأداة

source: Instance Error
ar: خطأ في المثيل

source: Message generation failed
ar: فشل توليد الرسالة

source: Could not retrieve added models
ar: تعذَّر جلب النماذج المضافة

source: Could not retrieve available models
ar: تعذَّر جلب النماذج المتوفرة

source: Ollama (Managed)
ar: أولاما (مُدار)

source: Local AI instance managed directly by Alpaca
ar: نموذج ذكاء اصطناعي محليّ مُدار من «الألبكة»

source: Alpaca Support
ar: دعم «الألبكة»

source: Model request too large for system
ar: طلب النموذج كبير جدًا للنظام

source: AMD GPU detected but the extension is missing, Ollama will use CPU.
ar: عُثِر على معالج AMD رسوميّ، ولكن الامتداد مفقود لذا سيستخدم أولاما المعالج بدلًا عنه.

source: AMD GPU detected but ROCm is missing, Ollama will use CPU.
ar: عُثِر على معالج AMD رسوميّ، ولكن ROCm مفقود لذا سيستخدم أولاما المعالج بدلًا عنه.

source: Using AMD GPU type '{}'
ar: يستخدم معالج AMD رسوميّ من نوع «ْ{}»

source: Integrated Ollama instance is not running
ar: مثيل أولاما المدمج لا يعمل

source: Managed Ollama instance failed to start
ar: فشل بدأ مثيل أولاما المُدار

source: Integrated Ollama instance is running
ar: مثيل أولاما المدمج لا يعمل

source: Local or remote AI instance not managed by Alpaca
ar: مثيل الذكاء الاصطناعي المحليّ أو البعيد لا يديره «الألبكة»

source: Generating message...
ar: يولِّد الرسالة...

source: Could not retrieve models
ar: تعذَّر جلب النماذج

source: Fireworks AI inference platform
ar: منصة استنباط الذكاء الاصطناعي Fireworks

source: Lambda Labs cloud inference API
ar: واجهة برمجة تطبيقات Lambda Labs سحابيَّة

source: Cerebras AI cloud inference API
ar: واجهة برمجة تطبيقات Cerebras AI سحابيَّة

source: Kluster AI cloud inference API
ar: واجهة برمجة تطبيقات Kluster AI سحابيَّة

source: Meta AI Llama API
ar: واجهة برمجة تطبيقات Meta AI Llama

source: OpenAI Compatible Instance
ar: مثيل متطابق مع OpenAI

source: AI instance compatible with OpenAI library
ar: مثيل ذكاء اصطناعي متوافق مع مكتبة OpenAI

source: Change Profile Picture
ar: غَيِّر صورة اللاحة

source: Voice
ar: الصوت

source: Default
ar: المبدئي

source: Tag
ar: الوسم

source: Family
ar: العائلة

source: Parameter Size
ar: حجم المعامل

source: Quantization Level
ar: مستوى التكمية

source: Parent Model
ar: النموذج الأم

source: Modified At
ar: عُدِّل في

source: Description
ar: الوصف

source: Context
ar: السياق
az: Kontekst

source: Remove Model
ar: أزل النموذج

source: Create Child
ar: أنشئ بنويًا

source: Languages
ar: اللغات

source: Change
ar: غيِّر

source: Model Profile Picture
ar: صورة لاحة النموذج

source: What do you want to do with the model's profile picture?
ar: ما الذي ترغب بالقيام به حيال صورة لاحة النموذج؟

source: Remove Model?
ar: أأزيل النموذج؟

source: Are you sure you want to remove '{}'?
ar: أمتأكّد من إزالة «{}»؟

source: Add Model
ar: أضف نموذجًا

source: By downloading this model you accept the license agreement available on the model's website
ar: من خلال تنزيل هذا النموذج، فأنت توافق على اتفاقية الترخيص المتوفرة على موقع الوِب الخاص بالنموذج

source: Multilingual
ar: متعدد اللغات

source: Code
ar: شفرة

source: Math
ar: رياضيات

source: Vision
ar: الرؤية

source: Embedding
ar: مضمن

source: Tools
ar: الأدوات

source: Reasoning
ar: الاستدلال

source: Small
ar: صغير

source: Medium
ar: متوسط

source: Big
ar: كبير

source: Huge
ar: ضخم

source: Identity
ar: الهويَّة

source: Base
ar: القاعدة
az: Əsas

source: Profile Picture
ar: صورة اللاحة

source: Open File
ar: افتح ملفًا

source: Describe the desired behavior of the model in its primary language (typically English).
ar: صِف السلوك المرغوب للنموذج بلغته الابتدائية (غالبًا ما تكون لغته هي الإنجليزية).

source: Behavior
ar: السلوك

source: Imagination
ar: التخيُّل

source: A higher number results in more diverse answers from the model. (top_k)
ar: كلما ارتفع الرقم نتجت أجوبة متنوعة من النموذج. (top_k)

source: Focus
ar: التركيز

source: A higher number widens the amount of possible answers. (top_p)
ar: كلما ارتفع الرقم عرضت كمية الأجوبة الممكنة من النموذج. (top_p)

source: Stop Download
ar: أوقف التنزيل

source: Stop Download?
ar: أأوقف التنزيل؟
az: Endirməni Dayandır?

source: Are you sure you want to stop pulling '{}'?
ar: أمتأكد من إيقاف جلب «{}»؟

source: Stop
ar: أوقِف
az: Dayandır

source: Model Manager Error
ar: خطأ بمدير النماذج

source: An error occurred whilst pulling '{}'
ar: حدث خطأ أثناء جلب «{}»

source: Download Completed
ar: اكتمل التنزيل

source: Model '{}' downloaded successfully.
ar: نَزِّل نموذج «{}» بنجاح.

source: Local text to speech model provided by Kokoro.
ar: نموذج نص إلى كلام موفَّر من Kokoro.

source: Local speech to text model provided by OpenAI Whisper.
ar: نموذج كلام إلى نص موفَّر من OpenAI Whisper.

source: Speech to Text
ar: تحويل الكلام إلى نص

source: Variables that are filled by the AI.
ar: المُتغيِّرات المملوءة من قبل الذكاء الاصطناعي.

source: AI Description
ar: وصف الذكاء الاصطناعي

source: The description the AI model will use to understand what the tool does.
ar: الوصف المستخدم من قبل نموذج الذكاء الاصطناعي لفهم ما تقوم به الأداة.

source: Variables
ar: المتغيِّرات

source: User filled values that the tool uses to work, the AI does not have access to these variables at all.
ar: قيم يملأها المستخدم وتستخدمها الأداة لتعمل. لا يمكن للذكاء الاصطناعي الوصول إلى هذه المتغيِّرات.

source: Gets the current date and/or time.
ar: يحصل على التاريخ\الوقت الحالي.

source: Gets a recipe by the meal's name
ar: احصل على الوصفة من خلال اسم الوجبة

source: YouTube Video
ar: فيديو يوتيوب

source: Source
ar: المصدر

source: Gets a list of food recipes by a specified category
ar: يحصل على قائمة وصفات طعام استنادًا لتصنيف محدد

source: Extracts an article from Wikipedia by it's title
ar: يستخرج مقالة من ويكيبيديا عبر عنوانها

source: Request to run a command using SSH to connect to the device
ar: يطلب تشغيل أمر من خلال بروتوكول النقل الآمن (SSH) للاتصال بالجهاز

source: IP Address
ar: عنوان IP

source: Network Port
ar: منفذ الشبكة

source: Model Requested to Run Command
ar: طلَّب النموذج تنفيذ أمر

source: Command
ar: الأمر

source: Explanation
ar: التوضيح

source: No explanation was provided
ar: لم يوفَّر أي توضيح

source: Make sure you understand what the command does before running it.
ar: عليك أن تفهم ما يقوم به الأمر قبل تنفيذه.

source: Chat with local AI models
az: Lokal süni intellekt modelləri ilə söhbət edin

source: An Ollama client
az: Bir Ollama klienti

source: Built in Ollama instance
az: Daxili Ollama nüsxəsi

source: A conversation involving image recognition
az: Şəkil tanıma funksiyasını əhatə edən bir söhbət

source: A conversation showing code highlighting
az: Kodun vurğulanmasını göstərən bir söhbət

source: A conversation involving a YouTube video transcript
az: YouTube video transkriptini əhatə edən bir söhbət

source: Multiple models being downloaded
az: Birdən çox model endirilir

source: Message edited successfully
az: Mesaj uğurla redaktə edildi

source: Failed to connect to server
az: Serverə qoşulmaq alınmadı

source: Stop Creating '{}'
az: '{}' Yaradılmasını Dayandır

source: image
az: şəkil

source: Select a Model
az: Bir Model Seçin

source: User message
az: İstifadəçi mesajı

source: Missing image
az: İtkin şəkil

source: Remove '{}'
az: '{}' Sil

source: Response message
az: Cavab mesajı

source: {}Code Block
az: {}Kod Bloku

source: Regenerate Response
az: Cavabı Yenidən Yarat

source: Task Complete
az: Tapşırıq Tamamlandı

source: Model '{}' pulled successfully.
az: '{}' modeli uğurla endirildi.

source: Pull Model Error
az: Model Endirmə Xətası

source: Failed to pull model '{}': {}
az: '{}' modelini endirmək alınmadı: {}

source: Error pulling '{}': {}
az: '{}' endirilərkən xəta: {}

source: Failed to pull model '{}' due to network error.
az: Şəbəkə xətası səbəbindən '{}' modelini endirmək alınmadı.

source: Error pulling '{}'
az: '{}' endirilərkən xəta

source: Stop Pulling '{}'
az: '{}' Endirilməsini Dayandır

source: Download {}:{}
az: {}:{} Yüklə

source: Image Recognition
az: Şəkil Tanıma

source: Enter download menu for {}
az: {} üçün endirmə menyusuna daxil ol

source: Open Model Manager
az: Model İdarəedicisini Aç

source: It looks like you don't have any models downloaded yet. Download models to get started!
az: Görünür, hələ heç bir model endirməmisiniz. Başlamaq üçün modelləri endirin!

source: Model deleted successfully
az: Model uğurla silindi

source: There was an error with the local Ollama instance, so it has been reset
az: Yerli Ollama nüsxəsində bir xəta baş verdi, buna görə sıfırlandı

source: Cannot open image
az: Şəkli açmaq olmur

source: This video is not available
az: Bu video mövcud deyil

source: Google Gemma 2 is now available in 2 sizes, 9B and 27B.
az: Google Gemma 2 indi 2 ölçüdə, 9B və 27B-də mövcuddur.

source: Chat cannot be cleared while receiving a message
az: Mesaj alarkən söhbət təmizlənə bilməz

source: Clear Chat?
az: Söhbəti Təmizlə?

source: Are you sure you want to clear the chat?
az: Söhbəti təmizləmək istədiyinizə əminsiniz?

source: Clear
az: Təmizlə

source: Create Chat?
az: Söhbət Yarat?

source: Enter name for new chat
az: Yeni söhbət üçün ad daxil edin

source: Create
az: Yarat

source: Are you sure you want to stop pulling '{} ({})'?
az: '{} ({})' endirilməsini dayandırmaq istədiyinizə əminsiniz?

source: Delete Model?
az: Modeli Sil?

source: Remove Attachment?
az: Əlavəni Sil?

source: Are you sure you want to remove attachment?
az: Əlavəni silmək istədiyinizə əminsiniz?

source: Connection Error
az: Bağlantı Xətası

source: The remote instance has disconnected
az: Uzaqdakı nüsxənin bağlantısı kəsildi

source: Close Alpaca
az: Alpaca-nı Bağla

source: Use local instance
az: Yerli nüsxədən istifadə et

source: Connect
az: Qoşul

source: Select Model
az: Model Seç

source: This model will be used as the base for the new model
az: Bu model yeni model üçün əsas kimi istifadə ediləcək

source: An error occurred while creating the model
az: Model yaradılarkən bir xəta baş verdi

source: Pull Model
az: Modeli Endir

source: Input the name of the model in this format name:tag
az: Modelin adını bu formatda daxil edin ad:teq

source: This video does not have any transcriptions
az: Bu videonun heç bir transkripsiyası yoxdur

source: {} Please select a transcript to include
az: {} Zəhmət olmasa daxil etmək üçün bir transkript seçin

source: An error occurred while extracting text from the website
az: Veb saytdan mətn çıxarılarkən bir xəta baş verdi

source: Message text box
az: Mesaj mətn qutusu

source: General
az: Ümumi

source: Use Remote Connection to Ollama
az: Ollama-ya Uzaqdan Bağlantıdan istifadə et

source: URL of Remote Instance
az: Uzaqdakı Nüsxənin URL-i

source: Bearer Token (Optional)
az: Bearer Token (İstəyə bağlı)

source: The temperature of the model. Increasing the temperature will make the model answer more creatively. (Default: 0.8)
az: Modelin temperaturu. Temperaturu artırmaq modelin daha yaradıcı cavab verməsinə səbəb olacaq. (Standart: 0.8)

source: Sets the random number seed to use for generation. Setting this to a specific number will make the model generate the same text for the same prompt. (Default: 0 (random))
az: Yaratmaq üçün istifadə ediləcək təsadüfi ədəd toxumunu təyin edir. Bunu xüsusi bir ədədə təyin etmək, modelin eyni sorğu üçün eyni mətni yaratmasına səbəb olacaq. (Standart: 0 (təsadüfi))

source: Keep Alive Time
az: Aktiv Qalma Müddəti

source: Controls how long the model will stay loaded into memory following the request in minutes (Default: 5)
az: Modelin sorğudan sonra yaddaşda nə qədər qalacağını dəqiqə ilə idarə edir (Standart: 5)

source: Ollama Instance
az: Ollama Nüsxəsi

source: Ollama Overrides
az: Ollama Üstünlükləri

source: Manage the arguments used on Ollama, any changes on this page only applies to the integrated instance, the instance will restart if you make changes.
az: Ollama-da istifadə olunan arqumentləri idarə edin, bu səhifədəki hər hansı bir dəyişiklik yalnız inteqrasiya olunmuş nüsxəyə aiddir, dəyişiklik etsəniz, nüsxə yenidən başlayacaq.

source: Manage models dialog
az: Modelləri idarə et dialoqu

source: Create Model
az: Model Yarat

source: Try a different search
az: Fərqli bir axtarış sınayın

source: By downloading this model you accept the license agreement available on the model's website.
az: Bu modeli endirməklə siz modelin veb saytında mövcud olan lisenziya müqaviləsini qəbul edirsiniz.

source: Some models require a modelfile, Alpaca fills FROM and SYSTEM (context) instructions automatically. Please visit the model's website or Ollama documentation for more information if you're unsure.
az: Bəzi modellər bir modelfile tələb edir, Alpaca FROM və SYSTEM (kontekst) təlimatlarını avtomatik olaraq doldurur. Əmin deyilsinizsə, daha çox məlumat üçün zəhmət olmasa modelin veb saytını və ya Ollama sənədlərini ziyarət edin.

source: File preview dialog
az: Fayla önbaxış dialoqu

source: Open With Default App
az: Standart Tətbiqlə Aç

source: Powered by Ollama
az: Ollama tərəfindən dəstəklənir

source: Ollama Website
az: Ollama Veb Saytı

source: Alpaca and its developers are not liable for any damages to devices or software resulting from the execution of code generated by an AI model. Please exercise caution and review the code carefully before running it.
az: Alpaca və onun tərtibatçıları bir Sİ modeli tərəfindən yaradılan kodun icrası nəticəsində cihazlara və ya proqram təminatına dəyən hər hansı zərərə görə məsuliyyət daşımır. Zəhmət olmasa, işə salmazdan əvvəl ehtiyatlı olun və kodu diqqətlə nəzərdən keçirin.

source: Clear Chat
az: Söhbəti Təmizlə

source: From Existing Model
az: Mövcud Modeldən

source: From GGUF File
az: GGUF Faylından

source: From Name
az: Addan

source: Close application
az: Tətbiqi bağla

source: Import chat
az: Söhbəti idxal et

source: Clear chat
az: Söhbəti təmizlə

source: New chat
az: Yeni söhbət

source: Show shortcuts window
az: Qısayollar pəncərəsini göstər

source: Manage models
az: Modelləri idarə et

source: Toggle sidebar
az: Yan paneli dəyişdir

source: Editor
az: Redaktor
