Repository: 8ar10der/Alpaca
Catalog: po/*.po
Languages: ar, az

source: Stable Code 3B is a coding model with instruct and code completion variants on par with models such as Code Llama 7B that are 2.5x larger.
ar: نموذج Stable Code 3B هو نموذج برمجي بـ 3 مليار مَعْلَمة، بإصدارات للتعليمات وإكمال الشفرات، يضاهي نماذج مثل Code Llama 7B التي تفوقه حجمًا بمقدار 2.5 مرة.
az: Stable Code 3B, 2.5 dəfə daha böyük olan Code Llama 7B kimi modellərlə bərabər səviyyədə olan təlimat və kod tamamlama variantları olan bir kodlaşdırma modelidir.

source: An experimental 1.1B parameter model trained on the new Dolphin 2.8 dataset by Eric Hartford and based on TinyLlama.
ar: نموذج تجريبي بحجم 1.1 مليار مَعْلَمة مُدَرَّب على مجموعة بيانات Dolphin 2.8 الجديدة من Eric Hartford ويستند إلى TinyLlama.
az: Eric Hartford tərəfindən yeni Dolphin 2.8 məlumat dəsti üzərində təlim keçmiş və TinyLlama əsasında hazırlanmış eksperimental 1.1B parametrli bir model.

source: OpenHermes 2.5 is a 7B model fine-tuned by Teknium on Mistral with fully open datasets.
ar: نموذج OpenHermes 2.5 هو نموذج بحجم 7 مليار مَعْلَمة حَسَّنَهُ Teknium على Mistral باستخدام مجموعات بيانات مفتوحة بالكامل.
az: OpenHermes 2.5, Teknium tərəfindən tam açıq məlumat dəstləri ilə Mistral üzərində incə tənzimlənmiş 7B modelidir.

source: Mistral Large 2 is Mistral's new flagship model that is significantly more capable in code generation, mathematics, and reasoning with 128k context window and support for dozens of languages.
ar: نموذج Mistral Large 2 هو النموذج الرائد الجديد من Mistral، وهو أكثر قدرة بشكل ملحوظ في توليد الشفرات البرمجية، والرياضيات، والاستدلال، مع نافذة سياق بحجم 128 ألف أمارَّة ودعم لعشرات اللغات.
az: Mistral Large 2, Mistral-ın 128k kontekst pəncərəsi və onlarla dilə dəstək ilə kod yaratma, riyaziyyat və mühakimə sahələrində əhəmiyyətli dərəcədə daha bacarıqlı olan yeni flaqman modelidir.

source: Qwen2 Math is a series of specialized math language models built upon the Qwen2 LLMs, which significantly outperforms the mathematical capabilities of open-source models and even closed-source models (e.g., GPT4o).
ar: نموذج Qwen2 Math هي سلسلة من النماذج اللغوية المتخصصة في الرياضيات مبنية على نماذج Qwen2 اللغوية الكبيرة، والتي تتفوق بشكل كبير على القدرات الرياضية للنماذج مفتوحة المصدر وحتى النماذج مغلقة المصدر (مثل GPT4o).

source: A strong multi-lingual general language model with competitive performance to Llama 3.
ar: نموذج لغوي عام قوي متعدد اللغات بأداء منافس لـ Llama 3.
az: Llama 3 ilə rəqabətədavamlı performansa malik güclü çoxdilli ümumi dil modeli.

source: Stable LM 2 is a state-of-the-art 1.6B and 12B parameter language model trained on multilingual data in English, Spanish, German, Italian, French, Portuguese, and Dutch.
ar: نموذج Stable LM 2 هو نموذج لغوي متطور بحجم 1.6 مليار و 12 مليار مَعْلَمة مُدَرَّب على بيانات متعددة اللغات تشمل الإنجليزية والإسبانية والألمانية والإيطالية والفرنسية والبرتغالية والهولندية.
az: Stable LM 2, İngilis, İspan, Alman, İtalyan, Fransız, Portuqal və Holland dillərində çoxdilli məlumatlar üzərində təlim keçmiş ən müasir 1.6B və 12B parametrli bir dil modelidir.

source: BakLLaVA is a multimodal model consisting of the Mistral 7B base model augmented with the LLaVA architecture.
ar: نموذج BakLLaVA هو نموذج متعدد الوسائط يتكون من نموذج Mistral 7B الأساسي مُعَزَّزًا بمعمارية LLaVA.
az: BakLLaVA, LLaVA arxitekturası ilə artırılmış Mistral 7B əsas modelindən ibarət bir multimodal modeldir.

source: A high-performing model trained with a new technique called Reflection-tuning that teaches a LLM to detect mistakes in its reasoning and correct course.
ar: نموذج عالي الأداء مُدَرَّب بتقنية جديدة تسمى الضبط الانعكاسي (Reflection-tuning) تعلم النموذج اللغوي الكبير اكتشاف الأخطاء في استدلاله وتصحيح مساره.

source: An advanced language model crafted with 2 trillion bilingual tokens.
ar: نموذج لغوي متقدم مُصَمَّم باستخدام 2 ترليون أمارَّة ثنائي اللغة.
az: 2 trilyon ikidilli tokenlə hazırlanmış qabaqcıl bir dil modeli.

source: This model extends LLama-3 8B's context length from 8k to over 1m tokens.
ar: يمدد هذا النموذج طول سياق LLama-3 8B من 8 آلاف إلى أكثر من مليون أمارَّة.
az: Bu model LLama-3 8B-nin kontekst uzunluğunu 8k-dan 1 milyondan çox tokenə qədər genişləndirir.

source: Model focused on math and logic problems
ar: نموذج يركز على المسائل الرياضية والمنطقية
az: Riyaziyyat və məntiq problemlərinə yönəlmiş model

source: moondream2 is a small vision language model designed to run efficiently on edge devices.
ar: نموذج moondream2 هو نموذج لغوي بصري صغير مصمم للعمل بكفاءة على الأجهزة الطرفية.
az: moondream2, kənar cihazlarda səmərəli işləmək üçün nəzərdə tutulmuş kiçik bir görmə dil modelidir.

source: A fine-tuned model based on Mistral with good coverage of domain and language.
ar: نموذج مُحَسَّن يستند إلى Mistral مع تغطية جيدة للمجالات واللغات.
az: Domen və dilin yaxşı əhatə olunması ilə Mistral əsasında incə tənzimlənmiş model.

source: A model from NVIDIA based on Llama 3 that excels at conversational question answering (QA) and retrieval-augmented generation (RAG).
ar: نموذج من NVIDIA يستند إلى Llama 3 يتفوق في الإجابة على الأسئلة الحوارية (QA) والتوليد المعزز بالاسترجاع (RAG).
az: Söhbətli sual-cavab (QA) və axtarışla zənginləşdirilmiş nəsil (RAG) sahələrində üstün olan Llama 3 əsaslı NVIDIA modeli.

source: Conversational model based on Llama 2 that performs competitively on various benchmarks.
ar: نموذج حواري يستند إلى Llama 2 يقدم أداءً تنافسيًا في مختلف مقاييس الأداء.
az: Müxtəlif bençmarklarda rəqabətədavamlı performans göstərən Llama 2 əsaslı söhbət modeli.

source: SQLCoder is a code completion model fined-tuned on StarCoder for SQL generation tasks
ar: نموذج SQLCoder هو نموذج لإكمال الشفرات البرمجية مُحَسَّن على StarCoder لمهام توليد SQL
az: SQLCoder, SQL yaratma tapşırıqları üçün StarCoder üzərində incə tənzimlənmiş bir kod tamamlama modelidir

source: General use models based on Llama and Llama 2 from Nous Research.
ar: نماذج للاستخدام العام تستند إلى Llama و Llama 2 من Nous Research.
az: Nous Research-dən Llama və Llama 2 əsaslı ümumi istifadə modelləri.

source: Code generation model based on Code Llama.
ar: نموذج لتوليد الشفرات البرمجية يستند إلى Code Llama.
az: Code Llama əsaslı kod yaratma modeli.

source: An extension of Llama 2 that supports a context of up to 128k tokens.
ar: امتداد لنموذج Llama 2 يدعم سياقًا يصل إلى 128 ألف أمارَّة.
az: 128k tokenə qədər konteksti dəstəkləyən Llama 2-nin bir uzantısı.

source: A 7B and 15B uncensored variant of the Dolphin model family that excels at coding, based on StarCoder2.
ar: إصدار غير خاضع للرقابة بحجم 7 مليار و 15 مليار مَعْلَمة من عائلة نماذج Dolphin يتفوق في البرمجة، ويستند إلى StarCoder2.
az: StarCoder2 əsasında kodlaşdırmada üstün olan Dolphin model ailəsinin 7B və 15B senzurasız variantı.

source: General use model based on Llama 2.
ar: نموذج للاستخدام العام يستند إلى Llama 2.
az: Llama 2 əsaslı ümumi istifadə modeli.

source: A strong, economical, and efficient Mixture-of-Experts language model.
ar: نموذج لغوي قوي واقتصادي وفعال يعتمد على مزيج الخبراء.
az: Güclü, qənaətli və səmərəli bir Mütəxəssislər Qarışığı dil modeli.

source: Starling is a large language model trained by reinforcement learning from AI feedback focused on improving chatbot helpfulness.
ar: نموذج Starling هو نموذج لغوي كبير مُدَرَّب بالتعلم المعزز من ردود فعل الذكاء الاصطناعي، يركز على تحسين فائدة روبوتات المحادثة.
az: Starling, chatbot faydalılığını artırmağa yönəlmiş Sİ rəyindən gücləndirici öyrənmə ilə təlim keçmiş böyük bir dil modelidir.

source: A companion assistant trained in philosophy, psychology, and personal relationships. Based on Mistral.
ar: مساعد رفيق مُدَرَّب في الفلسفة وعلم النفس والعلاقات الشخصية. يستند إلى Mistral.
az: Fəlsəfə, psixologiya və şəxsi münasibətlər sahəsində təlim keçmiş bir yoldaş köməkçi. Mistral əsaslı.

source: Hermes 3 is the latest version of the flagship Hermes series of LLMs by Nous Research
ar: نموذج Hermes 3 هو أحدث إصدار من سلسلة Hermes الرائدة للنماذج اللغوية الكبيرة من Nous Research

source: Yi-Coder is a series of open-source code language models that delivers state-of-the-art coding performance with fewer than 10 billion parameters.
ar: نماذج Yi-Coder هي سلسلة من نماذج اللغات البرمجية مفتوحة المصدر تقدم أداءً برمجيًا متطورًا بأقل من 10 مليار مَعْلَمة.

source: A large language model built by the Technology Innovation Institute (TII) for use in summarization, text generation, and chat bots.
ar: نموذج لغوي كبير طوره معهد الابتكار التكنولوجي (TII) للاستخدام في التلخيص وتوليد النصوص وروبوتات المحادثة.

source: InternLM2.5 is a 7B parameter model tailored for practical scenarios with outstanding reasoning capability.
ar: نموذج InternLM2.5 هو نموذج بحجم 7 مليار مَعْلَمة مصمم خصيصًا للسيناريوهات العملية مع قدرة استدلال متميزة.
az: InternLM2.5, üstün mühakimə qabiliyyəti ilə praktiki ssenarilər üçün nəzərdə tutulmuş 7B parametrli bir modeldir.

source: A compact, yet powerful 10.7B large language model designed for single-turn conversation.
ar: نموذج لغوي كبير مدمج وقوي بحجم 10.7 مليار مَعْلَمة مصمم للمحادثات أحادية الدور.
az: Tək dövrəli söhbət üçün nəzərdə tutulmuş yığcam, lakin güclü 10.7B böyük dil modeli.

source: Athene-V2 is a 72B parameter model which excels at code completion, mathematics, and log extraction tasks.
ar: نموذج Athene-V2 هو نموذج بحجم 72 مليار مَعْلَمة يتفوق في مهام إكمال الشفرات البرمجية والرياضيات واستخراج السجلات.

source: A new small LLaVA model fine-tuned from Phi 3 Mini.
ar: نموذج LLaVA صغير جديد مُحَسَّن انطلاقًا من Phi 3 Mini.
az: Phi 3 Mini-dən incə tənzimlənmiş yeni kiçik bir LLaVA modeli.

source: Orca 2 is built by Microsoft research, and are a fine-tuned version of Meta's Llama 2 models. The model is designed to excel particularly in reasoning.
ar: نموذج Orca 2 طورته Microsoft Research، وهو إصدار مُحَسَّن من نماذج Llama 2 من Meta. النموذج مصمم للتفوق بشكل خاص في الاستدلال.
az: Orca 2, Microsoft tədqiqatları tərəfindən hazırlanmışdır və Meta-nın Llama 2 modellərinin incə tənzimlənmiş bir versiyasıdır. Model xüsusilə mühakimədə üstün olmaq üçün nəzərdə tutulmuşdur.

source: A series of multimodal LLMs (MLLMs) designed for vision-language understanding.
ar: سلسلة من النماذج اللغوية الكبيرة متعددة الوسائط (MLLMs) مصممة لفهم الرؤية واللغة.

source: Llama 2 based model fine tuned on an Orca-style dataset. Originally called Free Willy.
ar: نموذج يستند إلى Llama 2 مُحَسَّن على مجموعة بيانات بأسلوب Orca. كان يسمى في الأصل Free Willy.
az: Orca tipli bir məlumat dəsti üzərində incə tənzimlənmiş Llama 2 əsaslı model. Əvvəlcə Free Willy adlanırdı.

source: Mistral Small 3 sets a new benchmark in the “small” Large Language Models category below 70B.
ar: نموذج Mistral Small 3 يضع معيارًا جديدًا في فئة النماذج اللغوية الكبيرة «الصغيرة» التي يقل حجمها عن 70 مليار مَعْلَمة.

source: 2.7B uncensored Dolphin model by Eric Hartford, based on the Phi language model by Microsoft Research.
ar: نموذج Dolphin غير خاضع للرقابة بحجم 2.7 مليار مَعْلَمة من Eric Hartford، ويستند إلى نموذج Phi اللغوي من Microsoft Research.
az: Microsoft Research tərəfindən hazırlanmış Phi dil modelinə əsaslanan Eric Hartford tərəfindən 2.7B senzurasız Dolphin modeli.

source: SmolLM2 is a family of compact language models available in three size: 135M, 360M, and 1.7B parameters.
ar: نماذج SmolLM2 هي عائلة من النماذج اللغوية المدمجة متوفرة بثلاثة أحجام: 135 مليون، و 360 مليون، و 1.7 مليار مَعْلَمة.

source: Uncensored version of Wizard LM model
ar: نسخة غير خاضعة للرقابة من نموذج Wizard LM
az: Wizard LM modelinin senzurasız versiyası

source: A commercial-friendly small language model by NVIDIA optimized for roleplay, RAG QA, and function calling.
ar: نموذج لغوي صغير مناسب للاستخدام التجاري من NVIDIA مُحَسَّن للعب الأدوار، والإجابة على الأسئلة باستخدام التوليد المعزز بالاسترجاع (RAG QA)، واستدعاء الدوال.

source: An extension of Mistral to support context windows of 64K or 128K.
ar: امتداد لنموذج Mistral لدعم نوافذ سياق بحجم 64 ألف أو 128 ألف أمارَّة.
az: 64K və ya 128K kontekst pəncərələrini dəstəkləmək üçün Mistral-ın bir uzantısı.

source: An expansion of Llama 2 that specializes in integrating both general language understanding and domain-specific knowledge, particularly in programming and mathematics.
ar: توسعة لنموذج Llama 2 متخصص في دمج فهم اللغة العام والمعرفة الخاصة بالمجال، ولا سيما في البرمجة والرياضيات.
az: Həm ümumi dil anlama, həm də sahəyə xas bilikləri, xüsusən proqramlaşdırma və riyaziyyatda inteqrasiya etməkdə ixtisaslaşan Llama 2-nin bir genişlənməsi.

source: Fine-tuned Llama 2 model to answer medical questions based on an open source medical dataset.
ar: نموذج Llama 2 مُحَسَّن للإجابة على الأسئلة الطبية بناءً على مجموعة بيانات طبية مفتوحة المصدر.
az: Açıq mənbəli bir tibbi məlumat dəsti əsasında tibbi suallara cavab vermək üçün incə tənzimlənmiş Llama 2 modeli.

source: Open-source medical large language model adapted from Llama 2 to the medical domain.
ar: نموذج لغوي كبير طبي مفتوح المصدر مُكَيَّف من Llama 2 للمجال الطبي.
az: Llama 2-dən tibbi sahəyə uyğunlaşdırılmış açıq mənbəli tibbi böyük dil modeli.

source: A series of models from Groq that represent a significant advancement in open-source AI capabilities for tool use/function calling.
ar: سلسلة من النماذج من Groq تمثل تقدمًا كبيرًا في قدرات الذكاء الاصطناعي مفتوحة المصدر لاستخدام الأدوات\استدعاء الدوال.
az: Alət istifadəsi/funksiya çağırma üçün açıq mənbəli Sİ imkanlarında əhəmiyyətli bir irəliləyişi təmsil edən Groq-dan bir sıra modellər.

source: Llama-3.1-Nemotron-70B-Instruct is a large language model customized by NVIDIA to improve the helpfulness of LLM generated responses to user queries.
ar: نموذج Llama-3.1-Nemotron-70B-Instruct هو نموذج لغوي كبير خصصته NVIDIA لتحسين فائدة الاستجابات التي يولدها النموذج اللغوي الكبير لاستفسارات المستخدمين.

source: Nexus Raven is a 13B instruction tuned model for function calling tasks.
ar: نموذج Nexus Raven هو نموذج بحجم 13 مليار مَعْلَمة مُحَسَّن بالتعليمات لمهام استدعاء الدوال.
az: Nexus Raven, funksiya çağırma tapşırıqları üçün 13B təlimatla tənzimlənmiş bir modeldir.

source: The Nous Hermes 2 model from Nous Research, now trained over Mixtral.
ar: نموذج Nous Hermes 2 من Nous Research، وهو مُدَرَّب الآن فوق Mixtral.
az: Nous Research-dən Nous Hermes 2 modeli, indi Mixtral üzərində təlim keçmişdir.

source: Great code generation model based on Llama2.
ar: نموذج رائع لتوليد الشفرات البرمجية يستند إلى Llama2.
az: Llama2 əsaslı əla kod yaratma modeli.

source: Uncensored Llama2 based model with support for a 16K context window.
ar: نموذج غير خاضع للرقابة يستند إلى Llama2 مع دعم نافذة سياق بحجم 16 ألف أمارَّة.
az: 16K kontekst pəncərəsi dəstəyi ilə senzurasız Llama2 əsaslı model.

source: The IBM Granite 2B and 8B models are designed to support tool-based use cases and support for retrieval augmented generation (RAG), streamlining code generation, translation and bug fixing.
ar: نماذج IBM Granite 2B و 8B مصممة لدعم حالات الاستخدام القائمة على الأدوات ودعم التوليد المعزز بالاسترجاع (RAG)، مما يسهل توليد الشفرات البرمجية والترجمة وإصلاح الأخطاء.

source: 🎩 Magicoder is a family of 7B parameter models trained on 75K synthetic instruction data using OSS-Instruct, a novel approach to enlightening LLMs with open-source code snippets.
ar: نماذج 🎩 Magicoder هي عائلة من النماذج بحجم 7 مليار مَعْلَمة مُدَرَّبة على 75 ألف بيان تعليمات اصطناعي باستخدام OSS-Instruct، وهو نهج مبتكر لتنوير النماذج اللغوية الكبيرة بمقتطفات شفرات برمجية مفتوحة المصدر.
az: 🎩 Magicoder, açıq mənbəli kod parçaları ilə LLM-ləri maarifləndirmək üçün yeni bir yanaşma olan OSS-Instruct istifadə edərək 75K sintetik təlimat məlumatı üzərində təlim keçmiş 7B parametrli modellər ailəsidir.

source: A lightweight chat model allowing accurate, and responsive output without requiring high-end hardware.
ar: نموذج محادثة خفيف الوزن يتيح إخراجًا دقيقًا وسريع الاستجابة دون الحاجة إلى أجهزة متطورة.
az: Yüksək səviyyəli avadanlıq tələb etmədən dəqiq və həssas çıxışa imkan verən yüngül bir söhbət modeli.

source: A high-performing code instruct model created by merging two existing code models.
ar: نموذج تعليمات برمجي عالي الأداء أنشئ عن طريق دمج نموذجين برمجيين موجودين.
az: İki mövcud kod modelini birləşdirərək yaradılmış yüksək performanslı bir kod təlimat modeli.

source: Falcon2 is an 11B parameters causal decoder-only model built by TII and trained over 5T tokens.
ar: نموذج Falcon2 هو نموذج مفكك شفرة سببي فقط بحجم 11 مليار مَعْلَمة طوره TII ودُرِّبَ على أكثر من 5 ترليون أمارَّة.
az: Falcon2, TII tərəfindən hazırlanmış və 5T token üzərində təlim keçmiş 11B parametrli səbəb-nəticə yalnız dekoder modelidir.

source: Wizard Vicuna is a 13B parameter model based on Llama 2 trained by MelodysDreamj.
ar: نموذج Wizard Vicuna هو نموذج بحجم 13 مليار مَعْلَمة يستند إلى Llama 2 دربه MelodysDreamj.
az: Wizard Vicuna, MelodysDreamj tərəfindən təlim keçmiş Llama 2 əsaslı 13B parametrli bir modeldir.

source: MistralLite is a fine-tuned model based on Mistral with enhanced capabilities of processing long contexts.
ar: نموذج MistralLite هو نموذج مُحَسَّن يستند إلى Mistral مع قدرات معززة لمعالجة السياقات الطويلة.
az: MistralLite, uzun kontekstləri emal etmək üçün təkmilləşdirilmiş qabiliyyətlərə malik Mistral əsasında incə tənzimlənmiş bir modeldir.

source: MathΣtral: a 7B model designed for math reasoning and scientific discovery by Mistral AI.
ar: نموذج MathΣtral: نموذج بحجم 7 مليار مَعْلَمة مصمم للاستدلال الرياضي والاكتشاف العلمي من Mistral AI.
az: MathΣtral: Mistral AI tərəfindən riyazi mühakimə və elmi kəşflər üçün nəzərdə tutulmuş 7B modeli.

source: 7B parameter text-to-SQL model made by MotherDuck and Numbers Station.
ar: نموذج تحويل النص إلى SQL بحجم 7 مليار مَعْلَمة من صنع MotherDuck و Numbers Station.
az: MotherDuck və Numbers Station tərəfindən hazırlanmış 7B parametrli mətndən-SQL-ə modeli.

source: MegaDolphin-2.2-120b is a transformation of Dolphin-2.2-70b created by interleaving the model with itself.
ar: نموذج MegaDolphin-2.2-120b هو تحويل لنموذج Dolphin-2.2-70b أنشئ عن طريق تشبيك النموذج مع نفسه.
az: MegaDolphin-2.2-120b, modeli özü ilə iç-içə keçirərək yaradılmış Dolphin-2.2-70b-nin bir transformasiyasıdır.

source: Solar Pro Preview: an advanced large language model (LLM) with 22 billion parameters designed to fit into a single GPU
ar: نموذج Solar Pro Preview: نموذج لغوي كبير متقدم بـ 22 مليار مَعْلَمة مصمم ليتناسب مع معالج رسوميّ واحد

source: A series of models that convert HTML content to Markdown content, which is useful for content conversion tasks.
ar: سلسلة من النماذج التي تحول محتوى لغة تأشير النص الترابطي (HTML) إلى محتوى مارك‌داون‏، وهو أمر مفيد لمهام تحويل المحتوى.

source: A top-performing mixture of experts model, fine-tuned with high-quality data.
ar: نموذج مزيج خبراء عالي الأداء، مُحَسَّن ببيانات عالية الجودة.
az: Yüksək keyfiyyətli məlumatlarla incə tənzimlənmiş yüksək performanslı bir mütəxəssislər qarışığı modeli.

source: A 7B chat model fine-tuned with high-quality data and based on Zephyr.
ar: نموذج محادثة بحجم 7 مليار مَعْلَمة مُحَسَّن ببيانات عالية الجودة ويستند إلى Zephyr.
az: Yüksək keyfiyyətli məlumatlarla incə tənzimlənmiş və Zephyr əsaslı 7B söhbət modeli.

source: Merge of the Open Orca OpenChat model and the Garage-bAInd Platypus 2 model. Designed for chat and code generation.
ar: دمج لنموذجي Open Orca OpenChat و Garage-bAInd Platypus 2. مصمم للمحادثة وتوليد الشفرات البرمجية.
az: Open Orca OpenChat modeli ilə Garage-bAInd Platypus 2 modelinin birləşməsi. Söhbət və kod yaratmaq üçün nəzərdə tutulmuşdur.

source: A language model created by combining two fine-tuned Llama 2 70B models into one.
ar: نموذج لغوي أنشئ عن طريق دمج نموذجين مُحَسَّنين من Llama 2 70B في نموذج واحد.
az: İki incə tənzimlənmiş Llama 2 70B modelini birinə birləşdirərək yaradılmış bir dil modeli.

source: The IBM Granite 1B and 3B models are the first mixture of experts (MoE) Granite models from IBM designed for low latency usage.
ar: نماذج IBM Granite 1B و 3B هي أول نماذج Granite من IBM تعتمد على مزيج الخبراء (MoE) ومصممة للاستخدام بزمن انتقال منخفض.

source: A 3.8B model fine-tuned on a private high-quality synthetic dataset for information extraction, based on Phi-3.
ar: نموذج بحجم 3.8 مليار مَعْلَمة مُحَسَّن على مجموعة بيانات اصطناعية خاصة عالية الجودة لاستخراج المعلومات، ويستند إلى Phi-3.
az: Məlumat çıxarmaq üçün xüsusi yüksək keyfiyyətli sintetik məlumat dəsti üzərində incə tənzimlənmiş, Phi-3 əsaslı 3.8B modeli.

source: Cohere For AI's language models trained to perform well across 23 different languages.
ar: نماذج Cohere For AI اللغوية المُدَرَّبة لتقديم أداء جيد عبر 23 لغة مختلفة.

source: DBRX is an open, general-purpose LLM created by Databricks.
ar: نموذج DBRX هو نموذج لغوي كبير مفتوح للأغراض العامة أنشأته Databricks.
az: DBRX, Databricks tərəfindən yaradılmış açıq, ümumi məqsədli bir LLM-dir.

source: An open large reasoning model for real-world solutions by the Alibaba International Digital Commerce Group (AIDC-AI).
ar: نموذج استدلال كبير مفتوح للحلول الواقعية من مجموعة Alibaba للتجارة الرقمية الدولية (AIDC-AI).

source: Embedding model from BAAI mapping texts to vectors.
ar: نموذج تضمين من BAAI يقوم بتحويل النصوص إلى متجهات.

source: An open weights function calling model based on Llama 3, competitive with GPT-4o function calling capabilities.
ar: نموذج استدعاء دوال بأوزان مفتوحة يستند إلى Llama 3، ومنافس لقدرات استدعاء الدوال في GPT-4o.
az: GPT-4o funksiya çağırma imkanları ilə rəqabətədavamlı, Llama 3 əsaslı açıq çəkili bir funksiya çağırma modeli.

source: A robust conversational model designed to be used for both chat and instruct use cases.
ar: نموذج حواريّ قوي مصمم للاستخدام في كل من حالات المحادثة واتباع التعليمات.
az: Həm söhbət, həm də təlimat istifadə halları üçün nəzərdə tutulmuş möhkəm bir söhbət modeli.

source: An upgraded version of DeekSeek-V2 that integrates the general and coding abilities of both DeepSeek-V2-Chat and DeepSeek-Coder-V2-Instruct.
ar: إصدار مُطَوَّر من DeepSeek-V2 يدمج القدرات العامة والبرمجية لكل من DeepSeek-V2-Chat و DeepSeek-Coder-V2-Instruct.

source: ShieldGemma is set of instruction tuned models for evaluating the safety of text prompt input and text output responses against a set of defined safety policies.
ar: نماذج ShieldGemma هي مجموعة من النماذج المُحَسَّنة بالتعليمات لتقييم أمان مُدخلات الأوامر النصية والاستجابات النصية المُخْرَجة وفقًا لمجموعة من سياسات السلامة المحددة.

source: A state-of-the-art fact-checking model developed by Bespoke Labs.
ar: نموذج متطور لتدقيق الحقائق طورته Bespoke Labs.

source: Llama Guard 3 is a series of models fine-tuned for content safety classification of LLM inputs and responses.
ar: نماذج Llama Guard 3 هي سلسلة من النماذج المُحَسَّنة لتصنيف سلامة محتوى مدخلات ومخرجات النماذج اللغوية الكبيرة.

source: Sentence-transformers model that can be used for tasks like clustering or semantic search.
ar: نموذج محولات الجمل (Sentence-transformers) يمكن استخدامه لمهام مثل التجميع أو البحث الدلالي.

source: OpenCoder is an open and reproducible code LLM family which includes 1.5B and 8B models, supporting chat in English and Chinese languages.
ar: نماذج OpenCoder هي عائلة نماذج لغوية كبيرة للشفرات البرمجية مفتوحة وقابلة للتكرار، وتشمل نماذج بحجم 1.5 مليار و 8 مليار مَعْلَمة، وتدعم المحادثة باللغتين الإنجليزية والصينية.

source: Tülu 3 is a leading instruction following model family, offering fully open-source data, code, and recipes by the The Allen Institute for AI.
ar: نماذج Tülu 3 هي عائلة نماذج رائدة في اتباع التعليمات، تقدم بيانات وشفرات ووصفات مفتوحة المصدر بالكامل من معهد Allen للذكاء الاصطناعي.

source: Snowflake's frontier embedding model. Arctic Embed 2.0 adds multilingual support without sacrificing English performance or scalability.
ar: نموذج التضمين الرائد من Snowflake. يضيف Arctic Embed 2.0 دعمًا متعدد اللغات دون التضحية بأداء اللغة الإنجليزية أو قابلية التوسع.

source: The IBM Granite Guardian 3.0 2B and 8B models are designed to detect risks in prompts and/or responses.
ar: نماذج IBM Granite Guardian 3.0 2B و 8B مصممة لاكتشاف المخاطر في الأوامر و\أو الاستجابات.
