Repository: 8ar10der/Alpaca
Catalog: po/*.po
Languages: ar, az

source: Alpaca
ar: الألبكة

source: ai;ollama;llm
ar: ذكاء اصطناعي;ذكاء صناعي;ذكاء مصطنع;ذكاء مصنع;أولاما;نموذج لغوي كبير;alpaca;ollama

source: Chat with AI models
ar: دَردِش مع نماذج الذكاء الاصطناعي

source: A private AI client
ar: عميل ذكاء اصطناعي خصوصي

source: Features
ar: المَيِّزات
az: Xüsusiyyətlər

source: Talk to multiple models in the same conversation
ar: التكلم مع عدة نماذج في نفس المحادثة
az: Eyni söhbətdə bir neçə model ilə danışın

source: Pull and delete models from the app
ar: جلب وحذف النماذج من التطبيق
az: Tətbiqdən modelləri endirin və silin

source: Have multiple conversations
ar: حيازة محادثات متعدِّدة
az: Birdən çox söhbət edin

source: Image recognition (Only available with compatible models)
ar: التعرُّف على الصور (متوفر فقط مع النماذج المتوافقة)
az: Şəkil tanıma (Yalnız uyğun modellərlə mövcuddur)

source: Plain text documents recognition
ar: التعرُّف على النصيَّة الصرفة
az: Sadə mətn sənədlərinin tanınması

source: Import and export chats
ar: استيراد وتصدير الدردشات
az: Söhbətləri idxal və ixrac edin

source: Append YouTube transcripts to the prompt
ar: إلحاق تسجيلات يوتيوب نصية بالطلب
az: YouTube transkriptlərini sorğuya əlavə edin

source: Append text from a website to the prompt
ar: إلحاق نص من موقع وِب بالطلب
az: Veb saytdan mətni sorğuya əlavə edin

source: PDF recognition
ar: التعَرُّف على PDF
az: PDF tanınması

source: Disclaimer
ar: إخلاء مسؤولية
az: İmtina Bəyannaməsi

source: This project is not affiliated at all with Ollama, I'm not responsible for any damages to your device or software caused by running code given by any models.
ar: هذا المشروع غير مرتبط بأولاما، والمطوِّر غير مسؤول عن أي ضرر يصيب أجهزتك أو برمجياتك جراء تشغيل الشفرة المعطاة من قبل أي نموذج.
az: Bu layihənin Ollama ilə heç bir əlaqəsi yoxdur, hər hansı bir model tərəfindən verilən kodu işlətməyin nəticəsində cihazınıza və ya proqram təminatınıza dəyən zərərlərə görə məsuliyyət daşımıram.

source: A normal conversation with an AI Model
ar: محادثة طبيعية مع نموذج ذكاء اصطناعي
az: Sİ Modeli ilə normal bir söhbət

source: A Python script running inside integrated terminal
ar: إخطاطة بايثون تعمل ضمن الطرفيَّة المدمجة

source: New
ar: الجديد
az: Yeni

source: Fixes
ar: الإصلاحات
az: Düzəlişlər

source: Multiple QuickAsk window rendering
ar: تصيير نوافذ QuickAsk متعددة

source: Better stability for QuickAsk
ar: استقرار وتحسين أفضل لـQuickAsk

source: Creating a new chat now selects it
ar: إنشاء دردشة جديدة يحددها الآن

source: Chat Search
ar: بحث الدردشة

source: Hide "latest" and "custom" tags from model selector
ar: إخفاء وسوم "latest" و"custom" من منتقِ النماذج

source: Hide model's languages behind popup
ar: أخفِ لغات النماذج خلف منبثقة

source: New models listed for Ollama
ar: أدرجت نماذج جديدة لأولاما

source: Added option to autodictate new mesages
ar: أضيف خيار لإملاء الرسائل الجديدة آليًا

source: Added Meta Llama API to list of instances
ar: أضيفت واجهة برمجة تطبيقات Meta AI Llama إلى قائمة المثيلات

source: Added new env variables options ("24H hour formatting" and "only Ollama mode")
ar: أضيفت متغيرات بيئية جديدة («تنسيق 24 ساعة» و«وضع أولاما حصرًا»)

source: Made Mermaid scripts executable using Python HTTP server
ar: فرض تنفيذيات إخطاطات Mermaid لتستخدم خادوم HTTP بايثون

source: Better stability when switching instances
ar: استقرار أفضل حين تبديل المثيلات

source: Better performance when navigating menus
ar: أداء أفضل أثناء التنقل بين القوائم

source: Fixed some dialogs not appearing in Quick Ask window
ar: إصلاح مشكلة عدم ظهور الحواريَّات في نافذة السؤال السريع

source: Faster message search
ar: بحث رسائل أسرع

source: Faster message rendering
ar: تصيير رسائل أسرع

source: Fixed whisper directory not existing causing error
ar: إصلاح عدم وجود مجلد «whisper» مما تسبب بأخطاء

source: Updated model list
ar: حُدِّثَت قائمة النماذج
az: Model siyahısı yeniləndi

source: Alpaca now remembers it's size
ar: صار بإمكان تطبيق «الألبكة» تذكر حجمه

source: Added reasoning category for Ollama models
ar: أضيف تصنيف الاستدلال لنماذج أولاما

source: Improvements in sample prompts
ar: حُسِّنَت عيِّنات الطلبات

source: Fixed auto creation of Ollama (Managed) instance
ar: أصلحت عِلَّة الإنشاء الآلي لمثيل أولاما (مُدار)

source: Removed legacy JSON to SQLite3 migration code
ar: أزيلت شفرة الانتقال من JSON إلى SQLite3 القديمة

source: Fixed power saving mode appearing whilst using online instances
ar: أصلحت عِلَّة ظهور وضع توفير الطاقة أثناء استخدام المثيلات عبر الإنترنت

source: Fixed Ollama (Manged) instance not being able to be created
ar: أصلحت عِلَّة عدم التمكن من إنشاء مثيل أولاما (مُدار)

source: Instance manager now follows default model
ar: أصبح مدير المثيلات يتبع النموذج المبدئي

source: English text-to-speech voices not working
ar: أصوات تحويل النص إلى كلام الإنجليزية لا تعمل

source: Instance manager sometimes not saving instances
ar: مدير المثيلات لا يحفظها أحيانًا

source: Fixed Gorq and Deepseek instances not generating text
ar: أصلحت عِلَّة عدم توليد نموذجي Gorq وDeepseek لنص

source: Smart tools for models
ar: أدوات ذكية للنماذج

source: Speech recognition (message dictation)
ar: التعرف على الكلام (إملاء الرسائل)

source: Text to Speech
ar: النص إلى كلام

source: New Quick Chat system
ar: نظام دردشة سريعة جديد

source: Filter Ollama models by categories
ar: ترشيح نماذج أولاما حسب التصنيفات

source: Better math Latex rendering in messages
ar: تحسين تصيير لاتِخ للرياضيات في الرسائل

source: Rich text rendering in attachment preview
ar: تصيير نص غني في معاينة المرفقات

source: Matplotlib is now included in Python code runner
ar: صار Matplotlib مضمنًا مع مُشَغِّل شفرة بايثون

source: Styling for messages being generated
ar: التصميم للرسائل قيد التوليد

source: New Instances
ar: المثيلات الجديدة

source: New Attachment Types
ar: أنواع مرفقات جديدة

source: Microsoft Word Document (docx)
ar: مستند مايكروسوفت وورد (docx)

source: Microsoft PowerPoint Document (pptx)
ar: مستند مايكروسوفت باوربوينت (pptx)

source: Microsoft Excel Document (xlsx)
ar: مستند مايكروسوفت إكسل (xlsx)

source: New Tools
ar: أدوات جديدة

source: Run Command (Testing)
ar: تنفيذ الأوامر (للاختبار)

source: Online Search
ar: البحث عبر الإنترنت

source: Extract Wikipedia Article
ar: استخراج مقالة ويكيبيديا

source: Get Recipe by Name
ar: الحصول على وصفة من اسمها

source: Get Recipes by Category
ar: الحصول على وصفات من تصنيفها

source: Get Current Datetime
ar: الحصول على التاريخ والوقت الحاليّ

source: Fixed welcome screen not showing sometimes when deleting a message
ar: أصلحت علة عدم ظهور شاشة الترحيب أحيانًا عند حذف رسالة

source: Fixed bold text not rendering correctly in tables
ar: أصلحت علة عدم تصيير النصوص الغليظة بشكل صحيح في الجداول

source: Fixed sample prompt buttons overflowing on small screens
ar: إصلاح تجاوز أزرار التلقينات النموذجية لحدودها في الشاشات الصغيرة

source: Updated runtime to Gnome 48
ar: تحديث بيئة التشغيل إلى جنوم 48

source: Added back 'category pills' to model manager
ar: إعادة إضافة علامات التصنيفات إلى مدير النماذج

source: Better appearance for model manager sidebar
ar: تحسين مظهر الشريط الجانبي لمدير النماذج

source: New models
ar: نماذج جديدة"

source: Fixed bad title generation with chain-of-thought models
ar: إصلاح مشكلة توليد العناوين غير الصحيحة مع نماذج سلسلة الأفكار"

source: Hide page switcher in model manager if there's only one page (online instances)
ar: إخفاء مبدّل الصفحات في مدير النماذج إذا كانت هناك صفحة واحدة فقط (للمثيلات المتصلة بالشبكة)

source: Option to delete all chats
ar: خيار لحذف كل المحادثات

source: Button to refresh sample prompts
ar: زر لتحديث الطلبات النموذجية

source: Fixed saving Ollama (Managed) instance might crash it
ar: إصلاح مشكلة احتمال انهيار مثيل أولاما (المُدار) عند حفظه

source: Fixed stop button
ar: إصلاح زر الإيقاف

source: Fixed model search not working if there are only pulling models
ar: إصلاح مشكلة عدم عمل البحث عن النماذج إذا كانت النماذج الوحيدة المتوفرة هي نماذج قيد الجلب

source: Fixed sample prompts sometimes not appearing
ar: إصلاح مشكلة عدم ظهور الطلبات النموذجية أحيانًا

source: Don't clear the building output of C++ scripts
ar: عدم محو مُخرجات بناء إخطاطات سي++

source: Better handling of attachments
ar: تحسين معالجة المرفقات"

source: Handle remote Ollama instance's API Key better
ar: معالجة أفضل لمفتاح واجهة برمجة تطبيقات الخاص بمثيل أولاما البعيد

source: Remove '\n' characters in instance edit page
ar: إزالة محارف `\n` في صفحة تعديل المثيل"

source: Dynamic chat loading
ar: تحميل متغيِّر للمحادثات

source: Updated Ollama instance
ar: تحديث مثيل أولاما

source: Tweaked appearance of models in model manager
ar: تعديل مظهر النماذج في مدير النماذج

source: Updated Ollama instance to 0.5.11
ar: تحديث مثيل أولاما إلى الإصدار 0.5.11

source: Added new models
ar: إضافة نماذج جديدة

source: New instance manager
ar: مدير مثيلات جديد

source: New welcome screen
ar: شاشة ترحيب جديدة

source: Exporting chats with 'thoughts' attachment is fixed
ar: إصلاح مشكلة تصدير المحادثات التي تحتوي على مرفق «الأفكار»

source: Fixed attachment filters
ar: إصلاح مرشحات المرفقات

source: New model manager
ar: مدير نماذج جديد

source: Changed GtkSpinner to AdwSpinner
ar: استبدال GtkSpinner بـ AdwSpinner

source: Better handling of launch process
ar: تحسين معالجة عملية الإطلاق

source: New loading screen at launch
ar: شاشة تحميل جديدة عند الإطلاق

source: Better handling of file types
ar: تحسين معالجة أنواع الملفات

source: Better regex expression for LaTeX equations
ar: تعبير نمطي أفضل لمعادلات لاتِخ

source: Confirmation dialog if user closes Alpaca whilst a model is downloading
ar: حواريّة تأكيد تظهر إذا أغلق المستخدم «الألبكة» أثناء تنزيل أحد النماذج

source: Better handling of think tags in messages
ar: تحسين معالجة وسوم التفكير في الرسائل

source: Default model is now in charge of generating titles
ar: النموذج المبدئي يتولى الآن توليد العناوين

source: Message header is now shown whilst the message is being generated
ar: تُعرَض الآن ترويسة الرسالة أثناء توليدها

source: Better handling of model profile pictures
ar: تحسين معالجة صور اللاحات للنماذج

source: New models in 'available models' list
ar: نماذج جديدة في قائمة «النماذج المتوفرة»

source: Added option for attaching screenshots
ar: إضافة خيار لإرفاق لقطات الشاشة

source: Basic LaTeX math equations are now rendered in messages
ar: تُعرَض الآن معادلات لاتخ الرياضية الأساسية في الرسائل

source: HTML and C++ scripts can now be run inside Alpaca
ar: يمكن الآن تشغيل إخطاطات لغة تأشير النص الترابطي (HTML) و سي++ داخل «الألبكة»

source: Added option to open the environment directory from the terminal
ar: إضافة خيار لفتح مجلد البيئة من الطرفية

source: Added option to edit code blocks directly
ar: إضافة خيار لتعديل كُتل الشفرة مباشرة

source: Complete keyboard shortcut list
ar: قائمة كاملة باختصارات لوحة المفاتيح

source: Images are now attached in 640p resolution
ar: تُرفَق الصور الآن بدقة 640p

source: Website attachments now use extracted titles
ar: مرفقات المواقع الإلكترونية تستخدم الآن العناوين المستخرجة

source: Better chat title generation
ar: تحسين توليد عناوين المحادثات

source: Added option to attach any plain text files
ar: إضافة خيار لإرفاق أي ملفات نصية بسيطة

source: Added spellchecker to message entry
ar: إضافة مدقق إملائي إلى حقل إدخال الرسائل

source: Alpaca's parameters are now stored using SQLite3
ar: تُخزَّن الآن معلمات «الألبكة» باستخدام SQLite3

source: Small appearance changes in text entries
ar: تغييرات طفيفة في مظهر حقول إدخال النص

source: Alpaca's launch process is more reliable
ar: عملية إطلاق «الألبكة» أصبحت أكثر موثوقية

source: Closing the terminal now kills the script subprocess
ar: إغلاق الطرفية ينهي الآن العملية الفرعية للإخطاطات

source: Transitioned chat backend from JSON to SQLite3
ar: نقل الواجهة الخلفية للمحادثات من JSON إلى SQLite3

source: Changed appearance of messages
ar: تغيير مظهر الرسائل

source: Added the option to add profile pictures to models
ar: إضافة خيار لإضافة صور لاحة للنماذج

source: Fix
ar: إصلاح
az: Düzəliş

source: Changed override HIP_VISIBLE_DEVICES to ROCR_VISIBLE_DEVICES
ar: تغيير التجاوز من `HIP_VISIBLE_DEVICES` إلى `ROCR_VISIBLE_DEVICES

source: Added categories to models
ar: إضافة تصنيفات للنماذج

source: Specified model's languages
ar: تحديد لغات النموذج

source: Added warning when downloading embedding models
ar: إضافة تحذير عند تنزيل نماذج التضمين

source: Replaced low ram warning with big model warning
ar: استبدال تحذير انخفاض ذاكرة الوصول العشوائي بتحذير النماذج الكبيرة

source: Correctly escape markup before rendering message
ar: تهريب الترميز بشكل صحيح قبل تصيير الرسالة

source: Fixed about dialog not working if log file was missing
ar: إصلاح مشكلة عدم عمل حواريَّة «حول» إذا كان ملف السجل مفقودًا

source: System messages can now be sent directly from Alpaca
ar: يمكن الآن إرسال رسائل النظام مباشرة من «الألبكة»

source: New redesign for messages and smaller minimum size
ar: إعادة تصميم جديدة للرسائل وتقليل الحد الأدنى للحجم

source: New models included in 'available models list'
ar: نماذج جديدة مُضمّنة في قائمة «النماذج المتوفرة»

source: Added symbolic icon when attaching code files
ar: إضافة أيقونة رمزية عند إرفاق ملفات الشفرة

source: When exporting a chat it now includes a markdown file
ar: عند تصدير محادثة، يتم الآن تضمينملف مارك‌داون

source: Refresh button in model manager when using a remote instance
ar: زر تحديث في مدير النماذج عند استخدام مثيل بعيد

source: Assistant messages are now editable
ar: رسائل المساعد أصبحت الآن قابلة للتعديل

source: Updated Ollama to v0.5.2
ar: تحديث أولاما إلى الإصدار v0.5.2

source: New option to change model directory
ar: خيار جديد لتغيير مجلد النماذج

source: File previewer now resizes dynamically to content
ar: مُعاين الملفات يتغير حجمه الآن ليناسب المحتوى

source: Adapted Alpaca to work without integrated Ollama instance
ar: تكييف «الألبكة» للعمل بدون مثيل أولاما المدمج

source: Compatibility added with ODT files
ar: إضافة التوافقية مع ملفات ODT

source: Restored ROCm compatibility
ar: استعادة التوافقية مع ROCm

source: Added long press gesture to chat rows so actions can be done in touchscreens
ar: إضافة إيماءة الضغط المطول لصفوف المحادثات لتنفيذ الإجراءات على شاشات اللمس

source: Fixed edit button not saving changes
ar: إصلاح مشكلة عدم حفظ زر التعديل للتغييرات

source: Changed max temperature value to 2
ar: تغيير القيمة القصوى لمعلمة 'temperature' إلى 2

source: Made seed 0 actually random
ar: جعل قيمة البذرة (seed) 0 عشوائية فعلًا

source: Fixed Gnome search provider not working outside of Flatpak installations
ar: إصلاح عدم عمل موفر بحث جنوم خارج تثبيتات فلاتباك

source: New option --ask MESSAGE, to open a new 'Quick Ask' window
ar: خيار جديد `--ask MESSAGE` لفتح نافذة جديدة 'للسؤال السريع'

source: Gnome Search integration now works whilst the app is opened
ar: تكامل بحث جنوم يعمل الآن أثناء فتح التطبيق

source: Added launch paramenters --ask MESSAGE, --new-chat CHAT, --select-chat CHAT, --list-chats, --version
ar: إضافة معلمات إطلاق: `--ask MESSAGE`, `--new-chat CHAT`, `--select-chat CHAT`, `--list-chats`, `--version`

source: Added integration as Gnome Search Provider
ar: إضافة التكامل كموفر بحث لجنوم

source: Updated Ollama to v0.4.2 with new models
ar: تحديث أولاما إلى الإصدار v0.4.2 مع نماذج جديدة

source: User messages are now compacted into bubbles
ar: رسائل المستخدم أصبحت الآن مضغوطة في فقاعات

source: Fixed re connection dialog not working when 'use local instance' is selected
ar: إصلاح عدم عمل حواريَّة إعادة الاتصال عند تحديد «استخدام مثيل محلي»

source: Fixed model manager not adapting to large system fonts
ar: إصلاح عدم تكيف مدير النماذج مع خطوط النظام الكبيرة

source: Details page for models
ar: صفحة تفاصيل للنماذج

source: Model selector gets replaced with 'manage models' button when there are no models downloaded
ar: استبدال محدد النماذج بزر «إدارة النماذج» عند عدم وجود نماذج منزّلة

source: Added warning when model is too big for the device
ar: إضافة تحذير عندما يكون النموذج كبيرًا جدًا بالنسبة للجهاز

source: Added AMD GPU indicator in preferences
ar: إضافة مؤشر لمعالج الرسوميات AMD في التفضيلات

source: Better system for handling dialogs
ar: نظام أفضل لمعالجة الحواريَّأت

source: Better system for handling instance switching
ar: نظام أفضل لمعالجة التبديل بين المثيلات

source: Remote connection dialog
ar: حواريَّة الاتصال عن بعد

source: Fixed: Models get duplicated when switching remote and local instance
ar: إصلاح: تكرار النماذج عند التبديل بين المثيل البعيد والمحلي

source: Better internal instance manager
ar: مدير مثيلات داخلي أفضل

source: Added 'Cancel' and 'Save' buttons when editing a message
ar: إضافة زري «ألغِ» و «احفظ» عند تعديل رسالة

source: Better handling of image recognition
ar: تحسين معالجة التعرف على الصور

source: Remove unused files when canceling a model download
ar: إزالة الملفات غير المستخدمة عند إلغاء تنزيل نموذج

source: Better message blocks rendering
ar: تحسين عرض كتل الرسائل

source: Run bash and python scripts straight from chat
ar: تشغيل إخطاطات باش و بايثون مباشرة من المحادثة

source: Updated Ollama to 0.3.12
ar: تحديث أولاما إلى الإصدار 0.3.12

source: New models!
ar: نماذج جديدة!

source: Fixed and made faster the launch sequence
ar: إصلاح وتسريع تسلسل الإطلاق

source: Better detection of code blocks in messages
ar: تحسين اكتشاف كتل الشفرة في الرسائل

source: Fixed app not loading in certain setups with Nvidia GPUs
ar: إصلاح عدم تحميل التطبيق في بعض الإعدادات التي تحتوي على معالجات رسوميات Nvidia

source: Fixed message notification sometimes crashing text rendering because of them running on different threads
ar: إصلاح إشعار الرسالة الذي يتسبب أحيانًا في انهيار عرض النص بسبب تشغيلهما في خيوط مختلفة

source: Fixed message generation sometimes failing
ar: إصلاح فشل توليد الرسائل أحيانًا

source: Sidebar resizes with the window
ar: تغيير حجم الشريط الجانبي مع النافذة

source: New welcome dialog
ar: حواريَّة ترحيبية جديدة

source: Message search
ar: البحث في الرسائل

source: Updated Ollama to v0.3.11
ar: تحديث أولاما إلى الإصدار v0.3.11

source: A lot of new models provided by Ollama repository
ar: الكثير من النماذج الجديدة متوفرة عبر مستودع أولاما

source: Fixed text inside model manager when the accessibility option 'large text' is on
ar: إصلاح النص داخل مدير النماذج عند تفعيل خيار الوصول «نص كبير»

source: Fixed image recognition on unsupported models
ar: إصلاح التعرف على الصور في النماذج غير المدعومة

source: Fixed spinner not hiding if the back end fails
ar: إصلاح عدم اختفاء مؤشر الدوران إذا فشلت الواجهة الخلفية

source: Fixed image recognition with local images
ar: إصلاح التعرف على الصور مع الصور المحلية

source: Changed appearance of delete / stop model buttons
ar: تغيير مظهر أزرار حذف \ إيقاف النموذج

source: Fixed stop button crashing the app
ar: إصلاح زر الإيقاف الذي يتسبب في انهيار التطبيق

source: Made sidebar resize a little when the window is smaller
ar: جعل الشريط الجانبي يتغير حجمه قليلًا عندما تكون النافذة أصغر

source: Instant launch
ar: إطلاق فوري

source: Fixed error on first run (welcome dialog)
ar: إصلاح الخطأ عند التشغيل لأول مرة (حواريَّة الترحيب)

source: Fixed checker for Ollama instance (used on system packages)
ar: إصلاح مدقق مثيل أولاما (المستخدم في حزم النظام)

source: Fixed 'clear chat' option
ar: إصلاح خيار «امحُ المحادثة»

source: Fixed welcome dialog causing the local instance to not launch
ar: إصلاح حواريَّة الترحيب التي تسببت في عدم إطلاق المثيل المحلي

source: Fixed support for AMD GPUs
ar: إصلاح دعم معالجات الرسوميات AMD

source: Model, message and chat systems have been rewritten
ar: إعادة كتابة أنظمة النماذج والرسائل والمحادثات

source: New models are available
ar: نماذج جديدة متوفرة

source: Ollama updated to v0.3.9
ar: تحديث أولاما إلى الإصدار v0.3.9

source: Added support for multiple chat generations simultaneously
ar: إضافة دعم لتوليد محادثات متعددة في وقت واحد

source: Added experimental AMD GPU support
ar: إضافة دعم تجريبي لمعالجات الرسوميات AMD

source: Added message loading spinner and new message indicator to chat tab
ar: إضافة مؤشر دوران لتحميل الرسائل ومؤشر رسالة جديدة إلى علامة تبويب المحادثة

source: Added animations
ar: إضافة رسوم متحركة

source: Changed model manager / model selector appearance
ar: تغيير مظهر مدير النماذج \ محدد النماذج

source: Changed message appearance
ar: تغيير مظهر الرسالة

source: Added markdown and code blocks to user messages
ar: إضافة مارك‌داون وكتل الشفرة إلى رسائل المستخدم

source: Added loading dialog at launch so the app opens faster
ar: إضافة حواريَّة تحميل عند الإطلاق ليفتح التطبيق بشكل أسرع

source: Added warning when device is on 'battery saver' mode
ar: إضافة تحذير عندما يكون الجهاز في وضع «توفير البطارية»

source: Added inactivity timer to integrated instance
ar: إضافة مؤقت عدم النشاط للمثيل المدمج

source: The chat is now scrolled to the bottom when it's changed
ar: تمرر الآن المحادثة إلى الأسفل عند تغييرها

source: Better handling of focus on messages
ar: تحسين معالجة التركيز على الرسائل

source: Better general performance on the app
ar: أداء عام أفضل في التطبيق

source: New duplicate chat option
ar: خيار جديد لتكرار المحادثة

source: Changed model selector appearance
ar: تغيير مظهر محدد النماذج"

source: Message entry is focused on launch and chat change
ar: يركز على حقل إدخال الرسائل عند الإطلاق وعند تغيير المحادثة

source: Message is focused when it's being edited
ar: يركز على الرسالة عند تعديلها

source: Added loading spinner when regenerating a message
ar: إضافة مؤشر دوران تحميل عند إعادة توليد رسالة

source: Added Ollama debugging to 'About Alpaca' dialog
ar: إضافة تصحيح أخطاء أولاما إلى حواريَّة 'عَنْ «الألبكة»'

source: Changed YouTube transcription dialog appearance and behavior
ar: تغيير مظهر وسلوك حواريَّات تفريغ يوتيوب النصي

source: CTRL+W and CTRL+Q stops local instance before closing the app
ar: مفتاحا CTRL+W و CTRL+Q يوقفان المثيل المحلي قبل إغلاق التطبيق

source: Changed appearance of 'Open Model Manager' button on welcome screen
ar: تغيير مظهر زر «افتح مدير النماذج» في شاشة الترحيب

source: Fixed message generation not working consistently
ar: إصلاح عدم عمل توليد الرسائل بشكل متسق

source: Fixed message edition not working consistently
ar: إصلاح عدم عمل تعديل الرسائل بشكل متسق

source: Model manager opens faster
ar: مدير النماذج يفتح بشكل أسرع
az: Model idarəedicisi daha sürətli açılır

source: Delete chat option in secondary menu
ar: خيار حذف المحادثة في القائمة الثانوية
az: İkinci menyuda söhbəti silmə seçimi

source: New model selector popup
ar: نافذة منبثقة جديدة لمحدد النماذج
az: Yeni model seçici pəncərəsi

source: Standard shortcuts
ar: اختصارات قياسية
az: Standart qısayollar

source: Model manager is navigable with keyboard
ar: يمكن التنقل في مدير النماذج باستخدام لوحة المفاتيح
az: Model idarəedicisi klaviatura ilə idarə oluna bilər

source: Changed sidebar collapsing behavior
ar: تغيير سلوك طي الشريط الجانبي
az: Yan panelin yığılma davranışı dəyişdirildi

source: Focus indicators on messages
ar: مؤشرات التركيز على الرسائل
az: Mesajlarda fokus göstəriciləri

source: Welcome screen
ar: شاشة الترحيب
az: Xoş gəlmisiniz ekranı

source: Give message entry focus at launch
ar: إعطاء التركيز لحقل إدخال الرسائل عند الإطلاق
az: Başlayanda mesaj daxiletmə sahəsinə fokus verin

source: Generally better code
ar: شفرة أفضل بشكل عام
az: Ümumilikdə daha yaxşı kod

source: Better width for dialogs
ar: عرض أفضل للحواريَّات
az: Dialoqlar üçün daha yaxşı en

source: Better compatibility with screen readers
ar: توافقية أفضل مع قارئات الشاشة
az: Ekran oxuyucuları ilə daha yaxşı uyğunluq

source: Fixed message regenerator
ar: إصلاح مولِّد إعادة إنشاء الرسائل
az: Mesaj yeniləyicisi düzəldildi

source: Removed 'Featured models' from welcome dialog
ar: إزالة «النماذج المختارة» من حواريَّة الترحيب
az: Xoş gəlmisiniz dialoqundan 'Seçilmiş modellər' çıxarıldı

source: Added default buttons to dialogs
ar: إضافة أزرار مبدئية إلى الحواريَّات
az: Dialoqlara standart düymələr əlavə edildi

source: Fixed import / export of chats
ar: إصلاح استيراد \ تصدير المحادثات
az: Söhbətlərin idxal/ixracı düzəldildi
