Repository: 8ar10der/Alpaca
Catalog: po/*.po
Languages: ar, az

source: User can now leave chat name empty when creating a new one, it will add a placeholder name
ar: يُمكِن للمُستخدِم الآن ترك اسم المحادثة فارغًا عند إنشاء محادثة جديدة، حيث سيُضاف اسم نائب آليًا
az: İstifadəçi indi yeni bir söhbət yaradarkən söhbət adını boş buraxa bilər, bu zaman yer tutucu bir ad əlavə ediləcək

source: Better scalling for different window sizes
ar: تحجيم أفضل لأحجام النوافذ المُختلفة
az: Fərqli pəncərə ölçüləri üçün daha yaxşı miqyaslama

source: Fixed: Can't close app if first time setup fails
ar: أُصلِح: تعذُّر إغلاق التطبيق إذا فشل الإعداد الأوَّلي
az: Düzəldildi: İlk dəfə quraşdırma uğursuz olarsa, tətbiqi bağlamaq olmur

source: Really Big Update
ar: تحديث كبير جدًا
az: Həqiqətən Böyük Yeniləmə

source: Added multiple chats support!
ar: إضافة دعم المحادثات المُتعدِّدة!
az: Birdən çox söhbət dəstəyi əlavə edildi!

source: Added Pango Markup support (bold, list, title, subtitle, monospace)
ar: إضافة دعم تنسيق Pango Markup (عريض، قائمة، عنوان، عنوان فرعي، خط أُحادي المسافة).
az: Pango İşarələmə dəstəyi əlavə edildi (qalın, siyahı, başlıq, alt başlıq, monoşrift)

source: Added autoscroll if the user is at the bottom of the chat
ar: إضافة التمرير الآلي إذا كان المُستخدِم في أسفل المحادثة
az: İstifadəçi söhbətin altındadırsa, avtomatik sürüşdürmə əlavə edildi

source: Added support for multiple tags on a single model
ar: إضافة دعم وسوم مُتعدِّدة للنموذج الواحد
az: Tək bir modeldə birdən çox teq üçün dəstək əlavə edildi

source: Added better model management dialog
ar: إضافة حواريّ أفضل لإدارة النماذج
az: Daha yaxşı model idarəetmə dialoqu əlavə edildi

source: Added loading spinner when sending message
ar: إضافة مُؤشِّر دوران للتحميل عند إرسال رسالة
az: Mesaj göndərilərkən yükləmə fırlatıcısı əlavə edildi

source: Added notifications if app is not active and a model pull finishes
ar: إضافة تنبيهات إذا لم يكن التطبيق نشطًا عند انتهاء جلب أحد النماذج
az: Tətbiq aktiv deyilsə və model endirilməsi başa çatarsa, bildirişlər əlavə edildi

source: Added new symbolic icon
ar: إضافة أيقونة رمزيَّة جديدة
az: Yeni simvolik ikona əlavə edildi

source: Added frame to message textview widget
ar: إضافة إطار لوِدْجَة عرض نص الرسالة
az: Mesaj mətn görünüşü vidcetinə çərçivə əlavə edildi

source: Fixed "code blocks shouldn't be editable"
ar: أُصلِح: «كُتَل الشفرة لا يجب أن تكون قابلةً للتعديل».
az: "kod blokları redaktə edilməməlidir" düzəldildi

source: Added code highlighting
ar: إضافة ميِّزة تمييز الشفرة المصدريِّة
az: Kod vurğulama əlavə edildi

source: Added image recognition (llava model)
ar: إضافة ميِّزة التعرُّف على الصوَر (نموذج llava).
az: Şəkil tanıma əlavə edildi (llava modeli)

source: Added multiline prompt
ar: إضافة مُوجِّه أوامر مُتعدِّد الأسطر
az: Çoxsətirli sorğu əlavə edildi

source: Fixed some small bugs
ar: إصلاح بعض الأخطاء البرمجيَّة الصغيرة
az: Bəzi kiçik xətalar düzəldildi

source: General optimization
ar: أمثلة عامَّة
az: Ümumi optimallaşdırma

source: Fixes and features
ar: إصلاحاتٌ وميّزاتٌ
az: Düzəlişlər və xüsusiyyətlər

source: Russian translation (thanks github/alexkdeveloper)
ar: الترجمة الروسيّة (شُكرًا لـ github/alexkdeveloper).
az: Rus tərcüməsi (təşəkkürlər github/alexkdeveloper)

source: Fixed: Cannot close app on first setup
ar: أُصلِح: تعذُّر إغلاق التطبيق عند الإعداد الأوَّلي
az: Düzəldildi: İlk quraşdırmada tətbiqi bağlamaq olmur

source: Fixed: Brand colors for Flathub
ar: إصلاح ألوان العلامة التجاريَّة لفلاتهب
az: Düzəldildi: Flathub üçün marka rəngləri

source: Fixed: App description
ar: إصلاح وصف التطبيق
az: Düzəldildi: Tətbiq təsviri

source: Fixed: Only show 'save changes dialog' when you actually change the url
ar: أُصلِح: إظهار مُربَّع حوار «احفظ التغييرات» فقط عند تغيير المسار فعليًّا
az: Düzəldildi: Yalnız url-i həqiqətən dəyişdirdikdə 'dəyişiklikləri yadda saxla dialoqu' göstər

source: 0.2.2 Bug fixes
ar: 0.2.2 إصلاحات أخطاء برمجيّة
az: 0.2.2 Xəta düzəlişləri

source: Toast messages appearing behind dialogs
ar: ظهور رسائل التنبيه الخاطفة خلف الحواريَّات
az: Dialoqların arxasında görünən bildiriş mesajları

source: Local model list not updating when changing servers
ar: عدم تحديث قائمة النماذج المحليَّة عند تغيير الخوادم
az: Serverləri dəyişdirərkən yerli model siyahısı yenilənmir

source: Closing the setup dialog closes the whole app
ar: إغلاق حواريَّة الإعداد الأولي يُغلِق التطبيق بأكمله
az: Quraşdırma dialoqunu bağlamaq bütün tətbiqi bağlayır

source: 0.2.1 Data saving fix
ar: 0.2.1 إصلاح حفظ البيانات
az: 0.2.1 Məlumat saxlama düzəlişi

source: The app didn't save the config files and chat history to the right directory, this is now fixed
ar: لم يحفظ التطبيق ملفَّات الإعدادات وسِجِل المحادثات في المُجلَّد الصحيح، وقد أُصلِحت هذه المُشكلة الآن
az: Tətbiq konfiqurasiya fayllarını və söhbət tarixçəsini düzgün qovluğa saxlamırdı, bu indi düzəldildi

source: New Features
ar: ميِّزات جديدة
az: Yeni Xüsusiyyətlər

source: Restore chat after closing the app
ar: استعادة المحادثة بعد إغلاق التطبيق
az: Tətbiqi bağladıqdan sonra söhbəti bərpa et

source: A button to clear the chat
ar: زر لمحو المحادثة
az: Söhbəti təmizləmək üçün bir düymə

source: Fixed multiple bugs involving how messages are shown
ar: إصلاح أخطاء برمجيّة مُتعدِّدة تتعلَّق بكيفيَّة عرض الرسائل
az: Mesajların necə göstərildiyi ilə bağlı bir neçə xəta düzəldildi

source: Added welcome dialog
ar: إضافة حواريَّة ترحيب
az: Xoş gəlmisiniz dialoqu əlavə edildi

source: More stability
ar: استقرار أفضل
az: Daha çox stabillik

source: 0.1.2 Quick fixes
ar: 0.1.2 إصلاحات سريعة
az: 0.1.2 Sürətli düzəlişlər

source: This release fixes some metadata needed to have a proper Flatpak application
ar: يُصلِح هذا الإصدار بعض البيانات الوصفيَّة اللازمة للحصول على تطبيق فلاتباك سليم
az: Bu buraxılış düzgün bir Flatpak tətbiqinə sahib olmaq üçün lazım olan bəzi metadataları düzəldir

source: 0.1.1 Stable Release
ar: 0.1.1 إصدارٌ مُستقِرٌّ
az: 0.1.1 Stabil Buraxılış

source: This is the first public version of Alpaca
ar: هذا هو الإصدار العامّ الأوَّل من «الألبكة»
az: Bu, Alpaca-nın ilk ictimai versiyasıdır

source: Open chat
ar: افتح دردشة

source: Quick ask
ar: سؤال سريع

source: Documentation
ar: التوثيق

source: Become a Sponsor
ar: تَبَرَّع

source: Discussions
ar: النقاشات

source: New state of the art 70B model. Llama 3.3 70B offers similar performance compared to the Llama 3.1 405B model.
ar: نموذج جديد متطور بـ 70 مليار مَعْلَمة. يقدم Llama 3.3 70B أداءً مشابهًا مقارنة بنموذج Llama 3.1 405B.

source: QwQ is the reasoning model of the Qwen series.
ar: نموذج QwQ هو نموذج الاستدلال ضمن سلسلة Qwen.

source: Llama 3.2 Vision is a collection of instruction-tuned image reasoning generative models in 11B and 90B sizes.
ar: نماذي Llama 3.2 Vision هي مجموعة من النماذج التوليدية المُحَسَّنة بالتعليمات لاستدلال الصور، متوفرة بأحجام 11 مليار و 90 مليار مَعْلَمة.

source: Meta's Llama 3.2 goes small with 1B and 3B models.
ar: نموذج Llama 3.2 من Meta يتوفر بأحجام صغيرة بنموذجَي 1 مليار و 3 مليار مَعْلَمة.

source: Llama 3.1 is a new state-of-the-art model from Meta available in 8B, 70B and 405B parameter sizes.
ar: نموذج Llama 3.1 هو نموذج جديد متطور من Meta، متوفر بأحجام 8 مليار و 70 مليار و 405 مليار مَعْلَمة.
az: Llama 3.1, Meta-dan 8B, 70B və 405B parametr ölçülərində mövcud olan yeni ən müasir modeldir.

source: Meta Llama 3: The most capable openly available LLM to date
ar: نموذج Meta Llama 3: النموذج اللغوي الكبير المتوفر الأكثر قدرة حتى الآن
az: Meta Llama 3: Bu günə qədər ən bacarıqlı açıq şəkildə mövcud olan LLM

source: The 7B model released by Mistral AI, updated to version 0.3.
ar: النموذج بحجم 7 مليار مَعْلَمة الذي أصدرته Mistral AI، مُحَدَّث إلى الإصدار 0.3.
az: Mistral AI tərəfindən buraxılmış, 0.3 versiyasına yenilənmiş 7B modeli.

source: A high-performing open embedding model with a large token context window.
ar: نموذج تضمين مفتوح المصدر عالي الأداء بنافذة سياق أمارَّات كبيرة.
az: Böyük bir token kontekst pəncərəsinə malik yüksək performanslı açıq daxiletmə modeli.

source: Gemma is a family of lightweight, state-of-the-art open models built by Google DeepMind. Updated to version 1.1
ar: نمذاج Gemma هي عائلة من النماذج المفتوحة المتطورة وخفيفة الوزن التي طورتها Google DeepMind. مُحَدَّثة إلى الإصدار 1.1
az: Gemma, Google DeepMind tərəfindən hazırlanmış yüngül, ən müasir açıq modellər ailəsidir. 1.1 versiyasına yeniləndi

source: Qwen 1.5 is a series of large language models by Alibaba Cloud spanning from 0.5B to 110B parameters
ar: نماذج Qwen 1.5 هي سلسلة من النماذج اللغوية الكبيرة من Alibaba Cloud تتراوح أحجامها من 0.5 مليار إلى 110 مليار مَعْلَمة
az: Qwen 1.5, Alibaba Cloud tərəfindən 0.5B-dən 110B-ə qədər parametrləri əhatə edən böyük dil modelləri seriyasıdır

source: Qwen2 is a new series of large language models from Alibaba group
ar: نماذج Qwen2 هي سلسلة جديدة من النماذج اللغوية الكبيرة من مجموعة Alibaba
az: Qwen2, Alibaba qrupundan yeni bir böyük dil modelləri seriyasıdır

source: Phi-3 is a family of lightweight 3B (Mini) and 14B (Medium) state-of-the-art open models by Microsoft.
ar: نماذج Phi-3 هي عائلة من النماذج المفتوحة المتطورة وخفيفة الوزن من Microsoft، وبحجم 3 مليار (Mini) و 14 مليار (Medium) مَعْلَمة.
az: Phi-3, Microsoft tərəfindən hazırlanmış yüngül 3B (Mini) və 14B (Orta) ən müasir açıq modellər ailəsidir.

source: Llama 2 is a collection of foundation language models ranging from 7B to 70B parameters.
ar: نماذج Llama 2 هي مجموعة من النماذج اللغوية التأسيسية تتراوح أحجامها من 7 مليار إلى 70 مليار مَعْلَمة.
az: Llama 2, 7B-dən 70B-ə qədər parametrləri olan təməl dil modelləri toplusudur.

source: Qwen2.5 models are pretrained on Alibaba's latest large-scale dataset, encompassing up to 18 trillion tokens. The model supports up to 128K tokens and has multilingual support.
ar: نماذج Qwen2.5 مُدَرَّبَة مُسْبَقًا على أحدث مجموعة بيانات واسعة النطاق من Alibaba، وتشمل ما يصل إلى 18 ترليون أمارَّة. يدعم النموذج ما يصل إلى 128 ألف أمارَّة ويدعم لغات متعددة.

source: Google Gemma 2 is a high-performing and efficient model available in three sizes: 2B, 9B, and 27B.
ar: نموذج Google Gemma 2 هو نموذج عالي الأداء وفعال متوفر بثلاثة أحجام: 2 مليار، و 9 مليار، و 27 مليار مَعْلَمة.

source: 🌋 LLaVA is a novel end-to-end trained large multimodal model that combines a vision encoder and Vicuna for general-purpose visual and language understanding. Updated to version 1.6.
ar: نموذج 🌋 LLaVA هو نموذج مبتكر كبير متعدد الوسائط مُدَرَّب بالكامل، ويجمع بين مُرَمِّز رؤية ونموذج Vicuna للفهم البصري واللغوي وللأغراض العامة. مُحَدَّث إلى الإصدار 1.6.
az: 🌋 LLaVA, ümumi məqsədli vizual və dil anlama üçün bir görmə kodlayıcısını və Vicuna-nı birləşdirən yeni, başdan sona təlim keçmiş böyük bir multimodal modeldir. 1.6 versiyasına yeniləndi.

source: A large language model that can use text prompts to generate and discuss code.
ar: نموذج لغوي كبير يمكنه استخدام الأوامر النصية لتوليد الشفرات البرمجية ومناقشتها.
az: Kod yaratmaq və müzakirə etmək üçün mətn sorğularından istifadə edə bilən böyük bir dil modeli.

source: The latest series of Code-Specific Qwen models, with significant improvements in code generation, code reasoning, and code fixing.
ar: أحدث سلسلة من نماذج Qwen المخصصة للشفرات البرمجية، مع تحسينات كبيرة في توليد الشفرات والاستدلال البرمجي وإصلاح الأخطاء.

source: A state-of-the-art 12B model with 128k context length, built by Mistral AI in collaboration with NVIDIA.
ar: نموذج متطور بحجم 12 مليار مَعْلَمة وبطول سياق 128 ألف أمارَّة، طورته Mistral AI بالتعاون مع NVIDIA.
az: NVIDIA ilə əməkdaşlıqda Mistral AI tərəfindən hazırlanmış 128k kontekst uzunluğuna malik ən müasir 12B modeli.

source: The TinyLlama project is an open endeavor to train a compact 1.1B Llama model on 3 trillion tokens.
ar: مشروع TinyLlama هو مسعى مفتوح لتدريب نموذج Llama مدمج بحجم 1.1 مليار مَعْلَمة على 3 ترليون أمارَّة.
az: TinyLlama layihəsi, 3 trilyon token üzərində yığcam 1.1B Llama modelini təlim etmək üçün açıq bir cəhddir.

source: State-of-the-art large embedding model from mixedbread.ai
ar: نموذج تضمين كبير متطور من mixedbread.ai
az: mixedbread.ai-dən ən müasir böyük daxiletmə modeli

source: StarCoder2 is the next generation of transparently trained open code LLMs that comes in three sizes: 3B, 7B and 15B parameters.
ar: نموذج StarCoder2 هو الجيل التالي من النماذج اللغوية الكبيرة المفتوحة والمُدَرَّبة بشفافية للشفرات البرمجية، ويأتي بثلاثة أحجام: 3 مليار و 7 مليار و 15 مليار مَعْلَمة.
az: StarCoder2, üç ölçüdə gələn şəffaf şəkildə təlim keçmiş açıq kodlu LLM-lərin növbəti nəslidir: 3B, 7B və 15B parametr.

source: A set of Mixture of Experts (MoE) model with open weights by Mistral AI in 8x7b and 8x22b parameter sizes.
ar: مجموعة من نماذج مزيج الخبراء (MoE) بأوزان مفتوحة من Mistral AI بأحجام 8x7 مليار و 8x22 مليار مَعْلَمة.
az: Mistral AI tərəfindən 8x7b və 8x22b parametr ölçülərində açıq çəkilərə malik Mütəxəssislər Qarışığı (MoE) model dəsti.

source: Uncensored, 8x7b and 8x22b fine-tuned models based on the Mixtral mixture of experts models that excels at coding tasks. Created by Eric Hartford.
ar: نماذج غير خاضعة للرقابة، مُحَسَّنة بأحجام 8x7 مليار و 8x22 مليار مَعْلَمة، تستند إلى نماذج مزيج الخبراء Mixtral وتتفوق في مهام البرمجة. أنشأها Eric Hartford.
az: Eric Hartford tərəfindən yaradılmış, kodlaşdırma tapşırıqlarında üstün olan Mixtral mütəxəssislər qarışığı modellərinə əsaslanan senzurasız, 8x7b və 8x22b incə tənzimlənmiş modellər.

source: CodeGemma is a collection of powerful, lightweight models that can perform a variety of coding tasks like fill-in-the-middle code completion, code generation, natural language understanding, mathematical reasoning, and instruction following.
ar: نماذج CodeGemma هي مجموعة من النماذج القوية وخفيفة الوزن التي يمكنها أداء مجموعة متنوعة من مهام البرمجة مثل إكمال الشفرات البرمجية في المنتصف، وتوليد الشفرات، وفهم اللغة الطبيعية، والاستدلال الرياضي، واتباع التعليمات.
az: CodeGemma, ortada kod tamamlama, kod yaratma, təbii dil anlama, riyazi mühakimə və təlimatlara əməl etmə kimi müxtəlif kodlaşdırma tapşırıqlarını yerinə yetirə bilən güclü, yüngül modellər toplusudur.

source: An open-source Mixture-of-Experts code language model that achieves performance comparable to GPT4-Turbo in code-specific tasks.
ar: نموذج لغوي برمجي مفتوح المصدر يعتمد على مزيج الخبراء ويحقق أداءً يضاهي GPT4-Turbo في المهام الخاصة بالشفرات البرمجية.
az: Kodla əlaqəli tapşırıqlarda GPT4-Turbo ilə müqayisə edilə bilən performans əldə edən açıq mənbəli Mütəxəssislər Qarışığı kod dil modeli.

source: Phi-2: a 2.7B language model by Microsoft Research that demonstrates outstanding reasoning and language understanding capabilities.
ar: نموذج Phi-2: نموذج لغوي بحجم 2.7 مليار مَعْلَمة من Microsoft Research يظهر قدرات متميزة في الاستدلال وفهم اللغة.
az: Phi-2: Microsoft Research tərəfindən hazırlanmış, üstün mühakimə və dil anlama qabiliyyətlərini nümayiş etdirən 2.7B dil modeli.

source: Uncensored Llama 2 model by George Sung and Jarrad Hope.
ar: نموذج Llama 2 غير خاضع للرقابة من George Sung و Jarrad Hope.
az: George Sung və Jarrad Hope tərəfindən senzurasız Llama 2 modeli.

source: DeepSeek Coder is a capable coding model trained on two trillion code and natural language tokens.
ar: نموذج DeepSeek Coder هو نموذج برمجة قوي مُدَرَّب على ترليوني أمارَّة من الشفرات البرمجية واللغة الطبيعية.
az: DeepSeek Coder, iki trilyon kod və təbii dil tokenləri üzərində təlim keçmiş bacarıqlı bir kodlaşdırma modelidir.

source: A suite of text embedding models by Snowflake, optimized for performance.
ar: مجموعة من نماذج تضمين النصوص من Snowflake، مُحَسَّنة لتحقيق أفضل أداء.
az: Performans üçün optimallaşdırılmış Snowflake tərəfindən hazırlanmış bir sıra mətn daxiletmə modelləri.

source: State of the art large language model from Microsoft AI with improved performance on complex chat, multilingual, reasoning and agent use cases.
ar: نموذج لغوي كبير متطور من Microsoft AI بأداء مُحَسَّن في المحادثات المعقدة، ودعم اللغات المتعددة، والاستدلال، وحالات استخدام الوكلاء.
az: Mürəkkəb söhbət, çoxdillilik, mühakimə və agent istifadə hallarında təkmilləşdirilmiş performansa malik Microsoft AI-dən ən müasir böyük dil modeli.

source: The uncensored Dolphin model based on Mistral that excels at coding tasks. Updated to version 2.8.
ar: نموذج Dolphin غير الخاضع للرقابة المستند إلى Mistral والذي يتفوق في مهام البرمجة. مُحَدَّث إلى الإصدار 2.8.
az: Kodlaşdırma tapşırıqlarında üstün olan Mistral əsaslı senzurasız Dolphin modeli. 2.8 versiyasına yeniləndi.

source: Dolphin 2.9 is a new model with 8B and 70B sizes by Eric Hartford based on Llama 3 that has a variety of instruction, conversational, and coding skills.
ar: نموذج Dolphin 2.9 هو نموذج جديد بأحجام 8 مليار و 70 مليار مَعْلَمة من Eric Hartford، يستند إلى Llama 3 ويمتلك مجموعة متنوعة من مهارات اتباع التعليمات والمحادثة والبرمجة.
az: Dolphin 2.9, Eric Hartford tərəfindən Llama 3 əsasında hazırlanmış, müxtəlif təlimat, söhbət və kodlaşdırma bacarıqlarına malik 8B və 70B ölçülü yeni bir modeldir.

source: Yi 1.5 is a high-performing, bilingual language model.
ar: نموذج Yi 1.5 هو نموذج لغوي ثنائي اللغة عالي الأداء.
az: Yi 1.5 yüksək performanslı, ikidilli bir dil modelidir.

source: Command R is a Large Language Model optimized for conversational interaction and long context tasks.
ar: نموذج Command R هو نموذج لغوي كبير مُحَسَّن للتفاعل الحواري والمهام ذات السياق الطويل.
az: Command R, söhbət qarşılıqlı əlaqəsi və uzun kontekstli tapşırıqlar üçün optimallaşdırılmış Böyük Dil Modelidir.

source: A general-purpose model ranging from 3 billion parameters to 70 billion, suitable for entry-level hardware.
ar: نموذج للأغراض العامة يتراوح حجمه من 3 مليار إلى 70 مليار مَعْلَمة، ومناسب للأجهزة ذات المستوى المبتدئ.
az: Giriş səviyyəli avadanlıq üçün uyğun olan, 3 milyarddan 70 milyarda qədər parametrli ümumi məqsədli model.

source: A LLaVA model fine-tuned from Llama 3 Instruct with better scores in several benchmarks.
ar: نموذج LLaVA مُحَسَّن انطلاقًا من Llama 3 Instruct مع درجات أفضل في العديد من مقاييس الأداء.
az: Bir neçə bençmarkda daha yaxşı nəticələr əldə etmək üçün Llama 3 Instruct-dan incə tənzimlənmiş bir LLaVA modeli.

source: Zephyr is a series of fine-tuned versions of the Mistral and Mixtral models that are trained to act as helpful assistants.
ar: نماذج Zephyr هي سلسلة من الإصدارات المُحَسَّنة لنماذج Mistral و Mixtral، مُدَرَّبة للعمل كمساعد مفيد.
az: Zephyr, faydalı köməkçilər kimi fəaliyyət göstərmək üçün təlim keçmiş Mistral və Mixtral modellərinin incə tənzimlənmiş versiyaları seriyasıdır.

source: A lightweight AI model with 3.8 billion parameters with performance overtaking similarly and larger sized models.
ar: نموذج ذكاء اصطناعي خفيف الوزن بـ 3.8 مليار مَعْلَمة يتفوق أداؤه على نماذج مماثلة وأكبر حجمًا.

source: Embedding models on very large sentence level datasets.
ar: نماذج تضمين مُدَرَّبة على مجموعات بيانات كبيرة جدًا على مستوى الجملة.
az: Çox böyük cümlə səviyyəli məlumat dəstləri üzərində daxiletmə modelləri.

source: Codestral is Mistral AI’s first-ever code model designed for code generation tasks.
ar: نموذج Codestral هو أول نموذج برمجي من Mistral AI مصمم لمهام توليد الشفرات البرمجية.
az: Codestral, Mistral AI-nin kod yaratma tapşırıqları üçün nəzərdə tutulmuş ilk kod modelidir.

source: StarCoder is a code generation model trained on 80+ programming languages.
ar: نموذج StarCoder هو نموذج لتوليد الشفرات البرمجية مُدَرَّب على أكثر من 80 لغة برمجة.
az: StarCoder, 80-dən çox proqramlaşdırma dilində təlim keçmiş bir kod yaratma modelidir.

source: General use chat model based on Llama and Llama 2 with 2K to 16K context sizes.
ar: نموذج محادثة للاستخدام العام يستند إلى Llama و Llama 2 بأحجام سياق تتراوح من 2 ألف إلى 16 ألف أمارَّة.
az: 2K-dan 16K-a qədər kontekst ölçüləri olan Llama və Llama 2 əsaslı ümumi istifadə üçün söhbət modeli.

source: A family of open foundation models by IBM for Code Intelligence
ar: عائلة من النماذج التأسيسية المفتوحة من IBM لذكاء الشفرات البرمجية
az: Kod Zəkası üçün IBM tərəfindən hazırlanmış açıq təməl modellər ailəsi

source: Mistral OpenOrca is a 7 billion parameter model, fine-tuned on top of the Mistral 7B model using the OpenOrca dataset.
ar: نموذج Mistral OpenOrca هو نموذج بـ 7 مليار مَعْلَمة، مُحَسَّن فوق نموذج Mistral 7B باستخدام مجموعة بيانات OpenOrca.
az: Mistral OpenOrca, OpenOrca məlumat dəstindən istifadə edərək Mistral 7B modelinin üzərində incə tənzimlənmiş 7 milyard parametrli bir modeldir.

source: 🪐 A family of small models with 135M, 360M, and 1.7B parameters, trained on a new high-quality dataset.
ar: 🪐 عائلة من النماذج الصغيرة بأحجام 135 مليون و 360 مليون و 1.7 مليار مَعْلَمة، مُدَرَّبة على مجموعة بيانات جديدة عالية الجودة.

source: Wizard Vicuna Uncensored is a 7B, 13B, and 30B parameter model based on Llama 2 uncensored by Eric Hartford.
ar: نموذج Wizard Vicuna Uncensored هو نموذج بأحجام 7 مليار و 13 مليار و 30 مليار مَعْلَمة يستند إلى Llama 2 غير الخاضع للرقابة من Eric Hartford.
az: Wizard Vicuna Uncensored, Eric Hartford tərəfindən senzurasız Llama 2 əsasında hazırlanmış 7B, 13B və 30B parametrli bir modeldir.

source: Llama 2 based model fine tuned to improve Chinese dialogue ability.
ar: نموذج يستند إلى Llama 2 مُحَسَّن لتحسين قدرة الحوار باللغة الصينية.
az: Çin dialoq qabiliyyətini yaxşılaşdırmaq üçün incə tənzimlənmiş Llama 2 əsaslı model.

source: BGE-M3 is a new model from BAAI distinguished for its versatility in Multi-Functionality, Multi-Linguality, and Multi-Granularity.
ar: نموذج BGE-M3 هو نموذج جديد من BAAI يتميز بتعدد وظائفه وتعدد لغاته وتعدد مستوياته التفصيلية.

source: A versatile model for AI software development scenarios, including code completion.
ar: نموذج متعدد الاستخدامات لسيناريوهات تطوير برمجيات الذكاء الاصطناعي، بما في ذلك إكمال الشفرات البرمجية.
az: Kod tamamlama da daxil olmaqla, Sİ proqram təminatı inkişaf ssenariləri üçün çox yönlü bir model.

source: A family of open-source models trained on a wide variety of data, surpassing ChatGPT on various benchmarks. Updated to version 3.5-0106.
ar: عائلة من النماذج مفتوحة المصدر مُدَرَّبة على مجموعة واسعة من البيانات، تتفوق على ChatGPT في مقاييس أداء مختلفة. مُحَدَّثة إلى الإصدار 3.5-0106.
az: Müxtəlif bençmarklarda ChatGPT-ni üstələyən, geniş məlumat çeşidi üzərində təlim keçmiş açıq mənbəli modellər ailəsi. 3.5-0106 versiyasına yeniləndi.

source: Aya 23, released by Cohere, is a new family of state-of-the-art, multilingual models that support 23 languages.
ar: نموذج Aya 23، الذي أصدرته Cohere هو عائلة جديدة من النماذج المتطورة متعددة اللغات تدعم 23 لغة.
az: Cohere tərəfindən buraxılan Aya 23, 23 dili dəstəkləyən yeni bir ən müasir, çoxdilli modellər ailəsidir.

source: CodeQwen1.5 is a large language model pretrained on a large amount of code data.
ar: نموذج CodeQwen1.5 هو نموذج لغوي كبير مُدَرَّب مُسْبَقًا على كمية كبيرة من بيانات الشفرات البرمجية.
az: CodeQwen1.5, böyük miqdarda kod məlumatı üzərində əvvəlcədən təlim keçmiş böyük bir dil modelidir.

source: The powerful family of models by Nous Research that excels at scientific discussion and coding tasks.
ar: عائلة النماذج القوية من Nous Research التي تتفوق في النقاشات العلمية ومهام البرمجة.
az: Elmi müzakirə və kodlaşdırma tapşırıqlarında üstün olan Nous Research tərəfindən hazırlanmış güclü modellər ailəsi.

source: Command R+ is a powerful, scalable large language model purpose-built to excel at real-world enterprise use cases.
ar: نموذج Command R+ هو نموذج لغوي كبير قوي وقابل للتوسع مصمم خصيصًا للتفوق في حالات الاستخدام المؤسسي الواقعية.
az: Command R+, real dünya müəssisə istifadə hallarında üstün olmaq üçün məqsədli şəkildə hazırlanmış güclü, miqyaslana bilən böyük bir dil modelidir.

source: State-of-the-art code generation model
ar: نموذج متطور لتوليد الشفرات البرمجية
az: Ən müasir kod yaratma modeli
