Repository: 8ar10der/Alpaca
Catalog: po/*.po
Languages: ar, az

source: EXAONE 3.5 is a collection of instruction-tuned bilingual (English and Korean) generative models ranging from 2.4B to 32B parameters, developed and released by LG AI Research.
ar: نماذج EXAONE 3.5 هي مجموعة من النماذج التوليدية ثنائية اللغة (الإنجليزية والكورية) المُحَسَّنة بالتعليمات تتراوح أحجامها من 2.4 مليار إلى 32 مليار مَعْلَمة، طورتها وأصدرتها LG AI Research.

source: Sailor2 are multilingual language models made for South-East Asia. Available in 1B, 8B, and 20B parameter sizes.
ar: نماذج Sailor2 هي نماذج لغوية متعددة اللغات مصممة لجنوب شرق آسيا. متوفرة بأحجام 1 مليار و 8 مليار و 20 مليار مَعْلَمة.

source: A family of efficient AI models under 10B parameters performant in science, math, and coding through innovative training techniques.
ar: عائلة من نماذج الذكاء الاصطناعي الفعالة بأقل من 10 مليار مَعْلَمة ذات أداء عالٍ في العلوم والرياضيات والبرمجة من خلال تقنيات تدريب مبتكرة.

source: The IBM Granite 2B and 8B models are text-only dense LLMs trained on over 12 trillion tokens of data, demonstrated significant improvements over their predecessors in performance and speed in IBM’s initial testing.
ar: نماذج IBM Granite 2B و 8B هي نماذج لغوية كبيرة كثيفة نصية فقط مُدَرَّبة على أكثر من 12 ترليون أمارَّة من البيانات، وأظهرت تحسينات كبيرة على سابقاتها في الأداء والسرعة في اختبارات IBM الأولية.

source: The IBM Granite 1B and 3B models are long-context mixture of experts (MoE) Granite models from IBM designed for low latency usage.
ar: نماذج IBM Granite 1B و 3B هي نماذج Granite من IBM تعتمد على مزيج الخبراء (MoE) ذات سياق طويل ومصممة للاستخدام بزمن انتقال منخفض.

source: The IBM Granite Embedding 30M and 278M models models are text-only dense biencoder embedding models, with 30M available in English only and 278M serving multilingual use cases.
ar: نماذج IBM Granite Embedding 30M و 278M هي نماذج تضمين كثيفة نصية فقط ذات تشفير ثنائي، حيث يتوفر النموذج 30M باللغة الإنجليزية فقط ويخدم النموذج 278M حالات الاستخدام متعددة اللغات.

source: Phi-4 is a 14B parameter, state-of-the-art open model from Microsoft.
ar: نموذج Phi-4 هو نموذج مفتوح متطور من Microsoft بحجم 14 مليار مَعْلَمة.

source: A new small reasoning model fine-tuned from the Qwen 2.5 3B Instruct model.
ar: نموذج استدلال صغير جديد مُحَسَّن انطلاقًا من نموذج Qwen 2.5 3B Instruct.

source: Dolphin 3.0 Llama 3.1 8B 🐬 is the next generation of the Dolphin series of instruct-tuned models designed to be the ultimate general purpose local model, enabling coding, math, agentic, function calling, and general use cases.
ar: نموذج Dolphin 3.0 Llama 3.1 8B 🐬 هو الجيل التالي من سلسلة نماذج Dolphin المُحَسَّنة بالتعليمات المصممة لتكون النموذج المحلي الأمثل للأغراض العامة، مما يتيح البرمجة والرياضيات والمهام الوكيلة واستدعاء الدوال وحالات الاستخدام العامة.

source: A strong Mixture-of-Experts (MoE) language model with 671B total parameters with 37B activated for each token.
ar: نموذج لغوي قوي يعتمد على مزيج الخبراء (MoE) بإجمالي 671 مليار مَعْلَمة، مع تفعيل 37 مليار مَعْلَمة لكل أمارَّة.

source: OLMo 2 is a new family of 7B and 13B models trained on up to 5T tokens. These models are on par with or better than equivalently sized fully open models, and competitive with open-weight models such as Llama 3.1 on English academic benchmarks.
ar: نماذج OLMo 2 هي عائلة جديدة من نماذج 7 مليار و 13 مليار مَعْلَمة مُدَرَّبة على ما يصل إلى 5 ترليون أمارَّة. هذه النماذج تضاهي أو تتفوق على النماذج المفتوحة بالكامل ذات الحجم المماثل، وتنافس النماذج ذات الأوزان المفتوحة مثل Llama 3.1 في مقاييس الأداء الأكاديمية باللغة الإنجليزية.

source: The smallest model in Cohere's R series delivers top-tier speed, efficiency, and quality to build powerful AI applications on commodity GPUs and edge devices.
ar: أصغر نموذج في سلسلة R من Cohere يقدم سرعة وكفاءة وجودة من الدرجة الأولى لبناء تطبيقات ذكاء اصطناعي قوية على معالجات الرسوميَّات التجارية والأجهزة الطرفية.

source: A fully open-source family of reasoning models built using a dataset derived by distilling DeepSeek-R1.
ar: عائلة مفتوحة المصدر بالكامل من نماذج الاستدلال مبنية باستخدام مجموعة بيانات مشتقة عن طريق تقطير DeepSeek-R1.

source: A fine-tuned version of Deepseek-R1-Distilled-Qwen-1.5B that surpasses the performance of OpenAI’s o1-preview with just 1.5B parameters on popular math evaluations.
ar: إصدار مُحَسَّن من Deepseek-R1-Distilled-Qwen-1.5B يتفوق على أداء OpenAI o1-preview بـ 1.5 مليار مَعْلَمة فقط في تقييمات الرياضيات الشائعة.

source: A version of the DeepSeek-R1 model that has been post trained to provide unbiased, accurate, and factual information by Perplexity.
ar: إصدار من نموذج DeepSeek-R1 دُرِّب لاحقًا لتقديم معلومات غير متحيزة ودقيقة وواقعية بواسطة Perplexity.

source: The current, most capable model that runs on a single GPU.
ar: النموذج الحالي الأكثر قدرة والذي يعمل على معالج رسوميَّات واحد.

source: Phi-4-mini brings significant enhancements in multilingual support, reasoning, and mathematics, and now, the long-awaited function calling feature is finally supported.
ar: نموذج Phi-4-mini يجلب تحسينات كبيرة في دعم اللغات المتعددة والاستدلال والرياضيات، والآن يدعم ميزة استدعاء الدوال التي طال انتظارها.

source: A compact and efficient vision-language model, specifically designed for visual document understanding, enabling automated content extraction from tables, charts, infographics, plots, diagrams, and more.
ar: نموذج لغوي بصري مدمج وفعال، ومصمم خصيصًا لفهم المستندات المرئية مما يتيح استخراج المحتوى الآلي من الجداول والرسوم البيانية والإنفوجرافيك والمخططات والرسوم التوضيحية والمزيد.

source: Granite-3.2 is a family of long-context AI models from IBM Granite fine-tuned for thinking capabilities.
ar: نماذج Granite-3.2 هي عائلة من نماذج الذكاء الاصطناعي ذات السياق الطويل من IBM Granite مُحَسَّنة لقدرات التفكير.

source: A new state-of-the-art version of the lightweight Command R7B model that excels in advanced Arabic language capabilities for enterprises in the Middle East and Northern Africa.
ar: إصدار جديد متطور من نموذج Command R7B خفيف الوزن يتفوق في قدرات اللغة العربية المتقدمة للمؤسسات في الشرق الأوسط وشمال إفريقيا.

source: 111 billion parameter model optimized for demanding enterprises that require fast, secure, and high-quality AI
ar: نموذج بـ 111 مليار مَعْلَمة مُحَسَّن للمؤسسات المتطلبة التي تحتاج إلى ذكاء اصطناعي سريع وآمن وعالي الجودة

source: Qwen3 is the latest generation of large language models in Qwen series, offering a comprehensive suite of dense and mixture-of-experts (MoE) models.
ar: نموذج Qwen3 هو الجيل الأحدث من النماذج اللغوية الكبيرة في سلسلة Qwen، ويقدم مجموعة شاملة من النماذج الكثيفة ونماذج مزيج الخبراء (MoE).

source: Devstral: the best open source model for coding agents
ar: Devstral: أفضل نموذج مفتوح المصدر لمفوِّضي البرمجة

source: Meta's latest collection of multimodal models.
ar: أحدث مجموعة من النماذج متعددة الوسائط من Meta.

source: Flagship vision-language model of Qwen and also a significant leap from the previous Qwen2-VL.
ar: النموذج الرائد لفهم اللغة والرؤية من Qwen، ويُعد أيضًا قفزة كبيرة مقارنة بالنموذج السابق Qwen2-VL.

source: DeepCoder is a fully open-Source 14B coder model at O3-mini level, with a 1.5B version also available.
ar: نموذج DeepCoder هو نموذج مبرمج مفتوح المصدر بالكامل بحجم 14 مليار مَعْلَمة بمستوى O3-mini، ومع توفر إصدار بحجم 1.5 مليار مَعْلَمة أيضًا.

source: Building upon Mistral Small 3, Mistral Small 3.1 (2503) adds state-of-the-art vision understanding and enhances long context capabilities up to 128k tokens without compromising text performance.
ar: يضيف Mistral Small 3.1 (2503) فهمًا متطورًا للرؤية ويعزز قدرات السياق الطويل حتى 128 ألف أمارَّة دون المساس بأداء النص. يستند على Mistral Small 3.

source: Cogito v1 Preview is a family of hybrid reasoning models by Deep Cogito that outperform the best available open models of the same size, including counterparts from LLaMA, DeepSeek, and Qwen across most standard benchmarks.
ar: نماذج Cogito v1 Preview هي عائلة من نماذج الاستدلال الهجينة من Deep Cogito تتفوق على أفضل النماذج المفتوحة المتاحة بنفس الحجم، بما في ذلك نظيراتها من LLaMA و DeepSeek و Qwen عبر معظم مقاييس الأداء القياسية.

source: IBM Granite 2B and 8B models are 128K context length language models that have been fine-tuned for improved reasoning and instruction-following capabilities.
ar: نماذج IBM Granite 2B و 8B هي نماذج لغوية بطول سياق 128 ألف أمارَّة تم تحسينها لتحسين قدرات الاستدلال واتباع التعليمات.

source: Phi 4 reasoning and reasoning plus are 14-billion parameter open-weight reasoning models that rival much larger models on complex reasoning tasks.
ar: نماذج Phi 4 reasoning و reasoning plus هي نماذج استدلال بأوزان مفتوحة بحجم 14 مليار مَعْلَمة تنافس نماذج أكبر بكثير في مهام الاستدلال المعقدة.

source: EXAONE Deep exhibits superior capabilities in various reasoning tasks including math and coding benchmarks, ranging from 2.4B to 32B parameters developed and released by LG AI Research.
ar: يُظهِر EXAONE Deep قدرات فائقة في مهام الاستدلال المختلفة بما في ذلك مقاييس أداء الرياضيات والبرمجة، بأحجام تتراوح من 2.4 مليار إلى 32 مليار مَعْلَمة، طورته وأصدرته LG AI Research.

source: Phi 4 mini reasoning is a lightweight open model that balances efficiency with advanced reasoning ability.
ar: نموذج Phi 4 mini reasoning هو نموذج مفتوح خفيف الوزن يوازن بين الكفاءة وقدرة الاستدلال المتقدمة.

source: Quick Ask
ar: سؤال سريع

source: Ollama Was Not Found
ar: لم يُعثر على أولاما

source: To add a managed Ollama instance, you must have Ollama installed locally in your device, this is a simple process and should not take more than 5 minutes.
ar: ينبغي تثبيت أولاما محليًا على جهازك لإضافة مثيل أولاما مدار. هذه عملية بسيطة ولن تستغرق أكثر من 5 دقائق.

source: Open Tutorial in Web Browser
ar: افتح العرض الإيضاحي في متصفح الوِب

source: Add Instance
ar: أضِف مثيلًا

source: Select a type of instance to add
ar: اختر نوع المثيل لإضافته

source: Cancel
ar: ألغِ
az: Ləğv Et

source: Hide
ar: أخفِ

source: Close
ar: أغلِق
az: Bağla

source: Close Alpaca?
ar: أأغلق «الألبكة»؟

source: A task is currently in progress. Are you sure you want to close Alpaca?
ar: هناك مهمة قيد التنفيذ. أمتأكد من إغلاق «الألبكة»؟

source: No tools enabled.
ar: لا أدوات مُفَعَّلة.

source: Open Tool Manager
ar: افتح مدير الأدوات

source: Please select a model before chatting
ar: اختر نموذجًا قبل الدردشة
az: Zəhmət olmasa, söhbət etməzdən əvvəl bir model seçin

source: Chat imported successfully
ar: استوردت الدردشة بنجاح
az: Söhbət uğurla idxal edildi

source: New Chat
ar: دردشة جديدة
az: Yeni Söhbət

source: Please enter the model name following this template: name:tag
ar: أدخِل اسم النموذج باتِّباع القالب التالي: اسم:وسم (name:tag)

# shortcut window
source: General
ar: عامّ

# shortcut window
source: Show Shortcuts
ar: أظهِر الاختصارات

# shortcut window
source: Preferences
ar: التفضيلات

# shortcut window
source: Quick Ask
ar: سؤال سريع

# shortcut window
source: Model Manager
ar: مدير النماذج

# shortcut window
source: Instance Manager
ar: مدير المثيلات

# shortcut window
source: Action Manager
ar: مدير الإجراءت

# shortcut window
source: Toggle Sidebar
ar: بدِّل الشريط الجانبي

# shortcut window
source: Quit
ar: اخرج

# shortcut window
source: Chat Management
ar: إدارة الدردشات

# shortcut window
source: Create Chat
ar: أنشِئ دردشة

# shortcut window
source: Delete Chat
ar: احذف الدردشة

# shortcut window
source: Clear Chat
ar: امح دردشة

# shortcut window
source: Rename Chat
ar: أعِد تسمية الدردشة

# shortcut window
source: Toggle Searchbars
ar: بدِّل أشرطة البحث

# shortcut window
source: Message Entry
ar: مدخلة الرسالة

source: Copy
ar: انسخ
az: Kopyala

source: Paste
ar: ألصق
az: Yapışdır

source: Open Emoji Menu
ar: افتح قائمة الإموجي

source: Insert new line
ar: أدخِل سطرًا جديدًا
az: Yeni sətir daxil et

source: Send Message as System
ar: أرسِل رسالة كالنظام

source: System messages are taken as literal instructions by models
ar: رسائل النظام تؤخذ كإرشادات حرفية من النماذج

source: Use Tools
ar: استخدم الأدوات

source: Ask model to use tools to generate a message
ar: اطلب من النماذج استعمال الأدوات لتوليد رسالة

source: Send Message as User
ar: أرسل رسالة كمستخدم

source: Notice
ar: إخطار

source: Preferences
ar: التفضيلات
az: Tərcihlər

source: Run Alpaca In Background
ar: تشغيل «الألبكة» في الخلفية
az: Alpaca-nı Arxa Planda İşə Sal

source: Show Power Saver Warning
ar: عرض تحذير توفير الطاقة

source: When running a managed Ollama instance
ar: عند تشغيل نموذج أولاما مُدار

source: Zoom
ar: التقريب

source: Speech Recognition Model
ar: نموذج التعرُّف على الكلام

source: Models are downloaded upon first use, you can delete them from the model manager
ar: تنزل النماذج عند أول استخدام، ويمكنك حذفها من مدير النماذج

source: Speech Recognition Language
ar: لغة التعرُّف على الكلام

source: Auto Send Message After Talking
ar: إرسال الرسالة آليًا بعد الكلام

source: Default Text to Speech Voice
ar: صوت مُحوِّل النص إلى كلام المبدئي

source: Voices are downloaded upon first use, each weighing around 1 MB, and you can delete them from the model manager
ar: تنزل الأصوات عند أول استخدام، وكل واحد منها يزن 1م.ب، ويمكنك حذفها من مدير النماذج

source: Dictate New Messages Automatically
ar: إملاء الرسائل الجديدة آليًا

source: Quick ask dialog
ar: حواريَّة السؤال السريع

source: Save Conversation to Alpaca
ar: احفظ الدردشة إلى «الألبكة»

source: Welcome
ar: الترحيب

source: Previous
ar: السابق
az: Əvvəlki

source: Next
ar: التالي
az: Növbəti

source: Welcome to Alpaca
ar: أهلًا بك في الألبكة
az: Alpaca-ya Xoş Gəlmisiniz

source: Powering your potential
ar: أطلِق قدراتك نحو الأفق

source: Alpaca and its developers are not liable for any damages to devices or software resulting from the execution of code generated by an AI model. Please exercise caution and review the code carefully before running it. Alpaca is distributed under GPL v3.0, this software comes with no warranty.
ar: لا يتحمَّل تطبيق «الألبكة» ومُطوِّروه أيّ مسؤوليَّة عن الأضرارِ التي قد تَلحَقُ بالأجهزةِ أو البرمجيَّات نتيجة تنفيذ الشَّفرات البرمجيَّة المُولَّدة بواسطةِ نماذِج الذكاء الاصطناعي. نرجو توخِّي الحذر ومراجعة الشَّفرة البرمجيَّة بعناية قبل تنفيذها. تُوَزَّع برمجية «الألبكة» تحت الإصدار الثالث لرخصة جنو العمومية، وتأتي البرمجية دون أيِّ ضمان.

source: Effortless Code Execution
ar: تنفيذ الشفرات البرمجيَّة بسلاسة

source: Alpaca can run Python, C++, and even HTML (with a live server) right from your conversations. Give it a try!
ar: يستطيع «الألبكة» تشغيل لغات بايثون، وسي++، وحتى لغة تأشير النص الترابطي HTML (مع خادُوم مُباشِر) مُباشَرة مِن مُحادَثاتِك. جَرِّب ذلِك بِنَفسِك!

source: Private by Design
ar: صُمِّم لِيَكون خصوصيًا

source: With Alpaca, your conversations are saved locally on your device, so you can be confident that your data is always secure and private.
ar: مُحادثاتُك مُخزَّنة مَحليًا على جهازك مع «الألبكة»، لذا يُمكنك أن تثق بأن بياناتك آمنة وخصوصية دائمًا.

source: Local AI
ar: ذكاء اصطناعي مَحَلِّي

source: Alpaca works with AI providers such as Gemini and ChatGPT. To run AI models locally on your machine, you'll need to install Ollama within Alpaca. We've made it super easy to do, so you can get started quickly!
ar: يعمل «الألبكة» مع مزوِّدي الذكاء الاصطناعي مثل Gemini وChatGPT. ستحتاج إلى تثبيت «أولاما» داخل «الألبكة» لتشغيل نماذج الذكاء الاصطناعي محليًا على جهازك، وقد سَهَّلنا هذه العملية للغاية كي تتمكن من البدء بسرعة!

source: Install Ollama
ar: ثَبِّت أولاما

source: Menu
ar: القائمة
az: Menyu

source: Search Chats
ar: ابحث الدرشات

source: Chat search bar
ar: شريط بحث الدردشة

source: Search chats
ar: ابحث الدردشات

source: Toggle Sidebar
ar: بدِّل الشريط الجانبي
az: Yan Paneli Dəyişdir

source: Search Messages
ar: ابحث الرسائل

source: Add Models
ar: أضِف نماذج

source: Manage Models
ar: أدِر النماذج
az: Modelləri İdarə Et

source: Chat Menu
ar: قائمة الدردشة
az: Söhbət Menyu

source: Message search bar
ar: شريط بحث الرسائل

source: Search messages
ar: البحث عن الرسائل

source: Warning: Power saver mode is enabled, this will slow down message generation
ar: تحذير: وضع توفير الطاقة مُفَعَّل. سيبطئ هذا الوضع توليد الرسائل

source: Instance Manager
ar: مدير المثيلات

source: No Instances Found
ar: لم يُعثَر على مثيلات

source: It looks a bit empty in here. Try adding an instance get started!
ar: يبدو المكان فارغًا هنا. أضِف مثيلًا لتبدأ!

source: Added Instances
ar: المثيلات المُضافة

source: Manage your AI instances, chats and messages are shared between instances when generating responses.
ar: أدِر مثيلات الذكاء الاصطناعي. الدردشات والرسائل مشتركة بين المثيلات عن توليد الردود.

source: Tool Manager
ar: مدير الأدوات

source: Available Tools
ar: الأدوات المتوفرة

source: Functions that AI models might use when sending a message by selecting "Use Tools" in the send button context menu.
ar: الوظائف التي قد تستخدمها نماذج الذكاء الاصطناعي عند إرسال رسالة من خلال اختيار «استخدم الأدوات» في قائمة السياق الخاصة بزر الإرسال.

source: Model Manager
ar: مدير النماذج

source: Search Model
ar: ابحث النماذج
az: Model Axtar

source: Model Manager Menu
ar: قائمة مدير النماذج

source: Model search bar
ar: شريط بحث النموذج
az: Model axtarış çubuğu

source: Search models
ar: البحث عن النماذج
az: Modelləri axtar

source: Filter Models
ar: رَشِّح النماذج

source: Added
ar: مُضاف

source: No Models Found
ar: لم يُعثَر على نماذج
az: Heç Bir Model Tapılmadı

source: It looks a bit empty in here. Try downloading some models or change your AI instance to get started!
ar: يبدو المكان فارغًا هنا. جرِّب تنزيل بعض النماذج أو تغيير مثيل الذكاء الاصطناعي الخاص بك لتبدأ!

source: Manage Instances
ar: أدِر المثيلات

source: Looks like we’re fresh out of models for that search. Try tweaking your keywords, or maybe explore something new!
ar: لم يعثر على نماذج لهذا البحث. حاول تطويع كلماتك المفتاحية أو ابحث عن شيء جديد!

source: Available
ar: متوفر

source: New Notebook
ar: دفتر جديد

source: Import Chat
ar: استورد دردشة
az: Söhbəti İdxal Et

source: Manage Tools
ar: أدِر الأدوات

source: Start Quick Ask
ar: اسأل سؤالًا سريعًا

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح
az: Klaviatura Qısayolları

source: About Alpaca
ar: عَنْ «الألبكة»
az: Alpaca Haqqında

source: Rename Chat
ar: أعِد تسمية الدردشة
az: Söhbətin Adını Dəyiş

source: Duplicate Chat
ar: كَرِّر الدردشة

source: Export Chat
ar: صَدِّر الدردشة
az: Söhbəti İxrac Et

source: Delete Chat
ar: احذف الدردشة
az: Söhbəti Sil

source: Reload Added Models
ar: أعِد تحميل النماذج المضافة

source: Remove Attachment
ar: أزِل المرفق
az: Əlavəni Sil

source: Delete Attachment?
ar: أأزيل المُرفق؟

source: Are you sure you want to delete '{}'?
ar: أمتأكِّد من حذف «{}»؟
az: '{}' silmək istədiyinizə əminsiniz?

source: Delete
ar: احذف
az: Sil

source: Image
ar: الصورة
az: Şəkil

source: Missing Image
ar: الصورة مفقودة
az: İtkin Şəkil

source: Any compatible Alpaca attachment
ar: أي مرفق متوافق مع «الألبكة»

source: Attach File
ar: أرفق ملفًّا
az: Fayl Əlavə Et

source: Attach Website
ar: أرفِق موقع وِب

source: Attach Website? (Experimental)
ar: أأرفق موقع الوِب؟ (تجريبي)
az: Veb Sayt Əlavə Et? (Eksperimental)

source: Please enter a website URL
ar: أدخِل مسار موقع وِب

source: Attach YouTube Captions
ar: أرفق تعليقات يوتيوب المصاحبة

source: Attach YouTube Captions?
ar: أأرفق تعليقات يوتيوب المصاحبة؟

source: Please enter a YouTube video URL
ar: أدخِل مسار فيديو يوتيوب

source: Attach Screenshot
ar: أرفِق لقطة شاشة

source: Try one of these prompts
ar: جَرِّب واحِدًا من هذه الطلبات
az: Bu sorğulardan birini sınayın

source: No Messages Found
ar: لم يُعثَر على رسائل

source: Uh oh! No messages found for your search.
ar: عذرًا، لم يعثر على رسائل لبحثك.

source: Send prompt: '{}'
ar: أرسِل طلب: «{}»
az: Sorğu göndər: '{}'

source: Refresh Prompts
ar: أعِد تحميل الطلبات

source: Accept
ar: اقبل
az: Qəbul Et

source: Rename Chat?
ar: أأُعيد تسمية الدردشة؟
az: Söhbətin Adını Dəyiş?

source: Renaming '{}'
ar: تُعاد تسمية «{}»
az: '{}' adını dəyişdirilir

source: Chat name
ar: اسم الدردشة

source: Rename
ar: أعِد التسمية
az: Adını Dəyiş

source: Delete Chat?
ar: أأحذف الدردشة؟
az: Söhbəti Sil?

source: Copy of {}
ar: نسخة من {}

source: Chat exported successfully
ar: صُدِّرَت الدردشة بنجاح
az: Söhbət uğurla ixrac edildi

source: User
ar: المستخدم

source: System
ar: النظام

source: Importable (.db)
ar: قابلة للاستيراد (.db)

source: Markdown
ar: مارك‌داون

source: Markdown (Obsidian Style)
ar: مارك‌داون (أسلوب أوبسِديان)

source: JSON
ar: جسون JSON

source: JSON (Include Metadata)
ar: جسون JSON (يتضمن بيانات وصفيَّة)

source: Select a method to export the chat
ar: اختر صيغة لتصدير الدردشة

source: Remove Message
ar: أزِل الرسالة
az: Mesajı Sil

source: Copy Message
ar: انسخ الرسالة
az: Mesajı Kopyala

source: Edit Message
ar: عَدِّل الرسالة
az: Mesajı Redaktə Et

source: Regenerate Message
ar: أعِد توليد الرسالة
az: Mesajı Yenidən Yarat

source: Message copied to the clipboard
ar: نُسِخَت الرسالة إلى الحافظة
az: Mesaj mübadilə buferinə kopyalandı

source: Message cannot be regenerated while receiving a response
ar: لا يمكن إعادة توليد الرسالة أثناء استلام رد
az: Cavab alarkən mesaj yenidən yaradıla bilməz

source: Thought
ar: تفكير

source: Attach YouTube Video?
ar: أأرفق فيديو يوتيوب؟
az: YouTube Videosu Əlavə Et?

source: Are you sure you want to attach '{}'?
ar: أترغب بإرفاق «ْْ{}»؟
az: Əlavə etmək istədiyinizə əminsiniz '{}'?

source: Image recognition is only available on specific models
ar: التعرُّف على الصور متوفر في نماذج محددَّة فقط
az: Şəkil tanıma yalnız xüsusi modellərdə mövcuddur

source: Send Message
ar: أرسل رسالة
az: Mesaj Göndər

source: Stop Message
ar: أوقِف الرسالة

source: Send as User
ar: أرسِل كمستخدم

source: Send as System
ar: أرسِل كالنظام

source: Dictate Message
ar: أملِ الرسالة

source: Use Speech Recognition
ar: استخدم التعرُّف على الكلام

source: Speech Recognition Error
ar: خطأ بالتعرف على الكلام

source: An error occurred while pulling speech recognition model
ar: حدث خطأ أثناء جلب نموذج التعرُّف على الكلام

source: An error occurred while using speech recognition
ar: حدث خطأ أثناء استخدام التعرف على الكلام

source: Download Speech Recognition Model
ar: نَزِّل نموذج التعرُّف على الكلام

source: To use speech recognition you'll need to download a special model ({})
ar: ستحتاج لتنزيل نموذج خاص ({}) للتعرف على الكلام

source: Download Model
ar: نَزِّل النموذج

source: Already Installed!
ar: مثبت مسبقًا!

source: Terminal
ar: الطرفيَّة

source: Setting up Python environment...
ar: يعد بيئة بايثون...

source: Using Python HTTP server...
ar: يستعمل خادوم HTTP بايثون...

source: Using Flatpak contained shell...
ar: يستخدم صدفة فلاتباك المنطويَّة...

source: Using SSH to run command
ar: يستخدم بروتوكول النقل الآمن (SSH) لتنفيذ الأمر

source: Open Environment Directory
ar: افتح مجلد البيئات

source: Script Exited
ar: خرجت الإخطاطة

source: Alpaca Terminal is not compatible with Windows
ar: طرفيَّة الألبكة غير متوافقة مع ويندوز

source: Changes saved successfully
ar: حُفظت التغييرات بنجاح

source: Code Block
ar: كتلة الشفرة
az: Kod Bloku

source: Edit Script
ar: حرِّر الإخطاط

source: Copy Script
ar: انسخ الإخطاط

source: Run Script
ar: نفِّذ الإخطاط

source: Code copied to the clipboard
ar: نُسِخَت الشفرة إلى الحافظة
az: Kod mübadilə buferinə kopyalandı

source: Copy Equation
ar: انسخ المعادلة

source: Equation copied to the clipboard
ar: نُسِخَت المعادلة إلى الحافظة

source: Save
ar: احفظ

source: Ollama Log
ar: سجِّل أولاما

source: Name
ar: الاسم
az: Ad

source: Port
ar: المنفذ

source: Which network port will '{}' use
ar: أي منفذ شبكة سيستعمله «{}»

source: Instance URL
ar: مسار المثيل

source: API Key
ar: مفتاح واجهة برمجة التطبيقات

source: API Key (Unchanged)
ar: مفتاح واجهة برمجة التطبيقات (غير مُعَدِّل)

source: API Key (Optional)
ar: مفتاح واجهة برمجة التطبيقات (اختياري)

source: Username
ar: اسم المستخدم

source: Max Tokens
ar: الأمَّارات القصوى
