Repository: 8ar10der/Alpaca
Catalog: po/*.po
Languages: ar, az

source: Changed Python2 title to Python on code blocks
ar: تغيير عنوان بايثون2 إلى بايثون في كتل الشفرة
az: Kod bloklarında Python2 başlığı Python olaraq dəyişdirildi

source: Prevent regeneration of title when the user changed it to a custom title
ar: منع إعادة توليد العنوان عندما يغيره المستخدم إلى عنوان مخصص
az: İstifadəçi başlığı xüsusi bir başlığa dəyişdirdikdə başlığın yenidən yaradılmasının qarşısı alındı

source: Show date on stopped messages
ar: إظهار التاريخ على الرسائل الموقوفة
az: Dayandırılmış mesajlarda tarixi göstər

source: Fix clear chat error
ar: إصلاح خطأ محو المحادثة
az: Söhbəti təmizləmə xətasını düzəlt

source: Changed shortcuts to standards
ar: تغيير الاختصارات إلى المعايير القياسية
az: Qısayollar standartlara uyğunlaşdırıldı

source: Moved 'Manage Models' button to primary menu
ar: نقل زر «إدارة النماذج» إلى القائمة الرئيسة
az: 'Modelləri İdarə Et' düyməsi əsas menyuya köçürüldü

source: Stable support for GGUF model files
ar: دعم مستقر لملفات نماذج GGUF
az: GGUF model faylları üçün stabil dəstək

source: General optimizations
ar: تحسينات عامة
az: Ümumi optimallaşdırmalar

source: Better handling of enter key (important for Japanese input)
ar: معالجة أفضل لمفتاح الإدخال (مهم للإدخال الياباني)
az: Enter düyməsinin daha yaxşı idarə olunması (Yapon dili üçün vacibdir)

source: Removed sponsor dialog
ar: إزالة حواريَّة التبرَُع
az: Sponsor dialoqu silindi

source: Added sponsor link in about dialog
ar: إضافة رابط الدعم في حواريَّة «حول»
az: Haqqında dialoquna sponsor linki əlavə edildi

source: Changed window and elements dimensions
ar: تغيير أبعاد النافذة والعناصر
az: Pəncərə və element ölçüləri dəyişdirildi

source: Selected model changes when entering model manager
ar: تغيير النموذج المحدد عند الدخول إلى مدير النماذج
az: Model idarəedicisinə daxil olduqda seçilmiş model dəyişir

source: Better image tooltips
ar: تلميحات صور أفضل
az: Daha yaxşı şəkil ipucları

source: GGUF Support
ar: دعم GGUF
az: GGUF Dəstəyi

source: Regenerate any response, even if they are incomplete
ar: إعادة توليد أي استجابة، حتى لو كانت غير مكتملة
az: Tamamlanmamış olsalar belə, istənilən cavabı yenidən yaradın

source: Support for pulling models by name:tag
ar: دعم جلب النماذج بواسطة `name:tag`
az: Modelləri ad:teq formatı ilə endirmə dəstəyi

source: Restored sidebar toggle button
ar: استعادة زر تبديل الشريط الجانبي
az: Yan paneli dəyişdirmə düyməsi bərpa edildi

source: Reverted back to standard styles
ar: العودة إلى الأنماط القياسية
az: Standart üslublara geri qayıdıldı

source: Fixed generated titles having "'S" for some reason
ar: إصلاح العناوين المولدة التي تحتوي على "'S" لسبب ما
az: Yaradılan başlıqlarda nədənsə "'S" olmasının qarşısı alındı

source: Changed min width for model dropdown
ar: تغيير الحد الأدنى لعرض القائمة المنسدلة للنماذج
az: Model açılan menyusu üçün minimum en dəyişdirildi

source: Changed message entry shadow
ar: تغيير ظل حقل إدخال الرسائل
az: Mesaj daxiletmə kölgəsi dəyişdirildi

source: The last model used is now restored when the user changes chat
ar: يستعاد الآن آخر نموذج مستخدم عندما يغير المستخدم المحادثة
az: İstifadəçi söhbəti dəyişdikdə istifadə edilən son model indi bərpa olunur

source: Better check for message finishing
ar: تحقق أفضل من انتهاء الرسالة
az: Mesajın bitməsinin daha yaxşı yoxlanılması

source: Added table rendering (Thanks Nokse)
ar: إضافة عرض الجداول (شكرًا لـ Nokse)
az: Cədvəl göstərilməsi əlavə edildi (Təşəkkürlər Nokse)

source: Made support dialog more common
ar: جعل حواريَّة الدعم تظهر بشكل أكثر شيوعًا
az: Dəstək dialoqu daha ümumi hala gətirildi

source: Dialog title on tag chooser when downloading models didn't display properly
ar: عنوان الحواريَّة في منتقي الوسوم عند تنزيل النماذج لم يُعرض بشكل صحيح
az: Modelləri endirərkən teq seçicisindəki dialoq başlığı düzgün göstərilmirdi

source: Prevent chat generation from generating a title with multiple lines
ar: منع توليد المحادثة من إنشاء عنوان متعدد الأسطر
az: Söhbət yaradılmasının çoxsətirli başlıq yaratmasının qarşısı alındı

source: Bearer Token entry on connection error dialog
ar: حقل إدخال أمارَّة الحامل (Bearer Token) في حواريَّة خطأ الاتصال
az: Bağlantı xətası dialoqunda Bearer Token girişi

source: Small appearance changes
ar: تغييرات طفيفة في المظهر
az: Kiçik görünüş dəyişiklikləri

source: Compatibility with code blocks without explicit language
ar: التوافقية مع كتل الشفرة التي لا تحدد اللغة بشكل صريح
az: Açıq-aşkar dil göstərilməyən kod blokları ilə uyğunluq

source: Rare, optional and dismissible support dialog
ar: مربع حوار دعم نادر، اختياري وقابل للإغلاق
az: Nadir, istəyə bağlı və rədd edilə bilən dəstək dialoqu

source: Date format for Simplified Chinese translation
ar: تنسيق التاريخ للترجمة الصينية المبسطة
az: Sadələşdirilmiş Çin tərcüməsi üçün tarix formatı

source: Bug with unsupported localizations
ar: علة في التوطينات غير المدعومة
az: Dəstəklənməyən lokalizasiyalarla bağlı xəta

source: Min height being too large to be used on mobile
ar: الحد الأدنى للارتفاع كبير جدًا للاستخدام على المحمول
az: Mobil cihazlarda istifadə üçün minimum hündürlüyün çox böyük olması

source: Remote connection checker bug
ar: علة في مدقق الاتصال عن بعد
az: Uzaqdan bağlantı yoxlayıcısı xətası

source: Models with capital letters on their tag don't work
ar: النماذج التي تحتوي على أحرف كبيرة في وسمها لا تعمل
az: Teqlərində böyük hərflər olan modellər işləmir

source: Ollama fails to launch on some systems
ar: فشل إطلاق أولاما على بعض الأنظمة
az: Ollama bəzi sistemlərdə işə düşmür

source: YouTube transcripts are not being saved in the right TMP directory
ar: نصوص يوتيوب لا تحفظ في مجلد TMP الصحيح
az: YouTube transkriptləri düzgün TMP qovluğunda saxlanılmır

source: Debug messages are now shown on the 'About Alpaca' dialog
ar: تُعرض الآن رسائل تصحيح الأخطاء في مربع حوار 'حول «الألبكة»'
az: 'Alpaca Haqqında' dialoqunda indi sazlama mesajları göstərilir

source: Updated Ollama to v0.3.0 (new models)
ar: تحديث أولاما إلى الإصدار v0.3.0 (نماذج جديدة)
az: Ollama v0.3.0-a yeniləndi (yeni modellər)

source: Models with '-' in their names didn't work properly, this is now fixed
ar: النماذج التي تحتوي على '-' في أسمائها لم تعمل بشكل صحيح، وقد أصلح هذا الآن
az: Adlarında '-' olan modellər düzgün işləmirdi, bu indi düzəldildi

source: Better connection check for Ollama
ar: تحقق أفضل من الاتصال بأولاما
az: Ollama üçün daha yaxşı bağlantı yoxlaması

source: Stable Release
ar: إصدار مستقر
az: Stabil Buraxılış

source: The new icon was made by Tobias Bernard over the Gnome Gitlab, thanks for the great icon!
ar: الأيقونة الجديدة صممها توبياس برنارد على جنوم غِت‌لاب، شكرًا على الأيقونة الرائعة!
az: Yeni ikona Gnome Gitlab-da Tobias Bernard tərəfindən hazırlandı, əla ikona üçün təşəkkürlər!

source: Features and fixes
ar: ميزات وإصلاحات
az: Xüsusiyyətlər və düzəlişlər

source: Updated Ollama instance to 0.2.8
ar: تحديث مثيل أولاما إلى 0.2.8
az: Ollama nüsxəsi 0.2.8-ə yeniləndi

source: Better model selector
ar: محدد نماذج أفضل
az: Daha yaxşı model seçici

source: Model manager redesign
ar: إعادة تصميم مدير النماذج
az: Model idarəedicisi yenidən dizayn edildi

source: Better tag selector when pulling a model
ar: محدد وسوم أفضل عند جلب نموذج
az: Model endirərkən daha yaxşı teq seçici

source: Model search
ar: البحث عن النماذج
az: Model axtarışı

source: Added support for bearer tokens on remote instances
ar: إضافة دعم أمارَّأت الحامل (bearer tokens) في المثيلات البعيدة
az: Uzaqdakı nüsxələrdə bearer tokenlər üçün dəstək əlavə edildi

source: Preferences dialog redesign
ar: إعادة تصميم حواريَّة التفضيلات
az: Tərcihlər dialoqu yenidən dizayn edildi

source: Added context menus to interact with a chat
ar: إضافة قوائم سياقية للتفاعل مع المحادثة
az: Söhbətlə qarşılıqlı əlaqə üçün kontekst menyuları əlavə edildi

source: Redesigned primary and secondary menus
ar: إعادة تصميم القوائم الرئيسية والثانوية
az: Əsas və ikinci dərəcəli menyular yenidən dizayn edildi

source: YouTube integration: Paste the URL of a video with a transcript and it will be added to the prompt
ar: تكامل يوتيوب: ألصق مسارًا لفيديو يحتوي على نص وسوف يُضاف إلى التلقين
az: YouTube inteqrasiyası: Transkripti olan bir videonun URL-ni yapışdırın və o, sorğuya əlavə ediləcək

source: Website integration (Experimental): Extract the text from the body of a website by adding it's URL to the prompt
ar: تكامل المواقع الإلكترونية (تجريبي): استخرج النص من محتوى موقع بإضافة المسار الخاص به إلى التلقين
az: Veb sayt inteqrasiyası (Eksperimental): URL-ni sorğuya əlavə edərək veb saytın əsas hissəsindən mətni çıxarın

source: Chat title generation
ar: توليد عنوان المحادثة
az: Söhbət başlığı yaradılması

source: Auto resizing of message entry
ar: تغيير حجم حقل إدخال الرسائل آليًا
az: Mesaj daxiletmə sahəsinin avtomatik ölçüləndirilməsi

source: Chat notifications
ar: تنبيهات الدردشة
az: Söhbət bildirişləri

source: Added indicator when an image is missing
ar: إضافة مؤشر عند فقدان صورة
az: Şəkil çatışmadıqda göstərici əlavə edildi

source: Auto rearrange the order of chats when a message is received
ar: إعادة ترتيب المحادثات آليًا عند استلام رسالة
az: Mesaj alındıqda söhbətlərin sırasını avtomatik yenidən təşkil et

source: Redesigned file preview dialog
ar: إعادة تصميم حواريَّة معاينة الملفات
az: Fayla önbaxış dialoqu yenidən dizayn edildi

source: Credited new contributors
ar: إشادة المساهمين الجدد
az: Yeni iştirakçılara təşəkkür edildi

source: Better stability and optimization
ar: استقرار وتحسين أفضل
az: Daha yaxşı stabillik və optimallaşdırma

source: Edit messages to change the context of a conversation
ar: تعديل الرسائل لتغيير سياق المحادثة
az: Söhbətin kontekstini dəyişmək üçün mesajları redaktə edin

source: Added disclaimers when pulling models
ar: إضافة إخلاءات مسؤولية عند جلب النماذج
az: Modelləri endirərkən imtina bəyannamələri əlavə edildi

source: Preview files before sending a message
ar: معاينة الملفات قبل إرسال الرسالة
az: Mesaj göndərmədən əvvəl fayllara önbaxış edin

source: Better format for date and time on messages
ar: تنسيق أفضل للتاريخ والوقت في الرسائل
az: Mesajlarda tarix və vaxt üçün daha yaxşı format

source: Error and debug logging on terminal
ar: تسجيل الأخطاء وتصحيحها في الطرفية
az: Terminalda xəta və sazlama qeydləri

source: Auto-hiding sidebar button
ar: زر الشريط الجانبي المخفي آليًا
az: Avtomatik gizlənən yan panel düyməsi

source: Various UI tweaks
ar: تعديلات متنوعة في واجهة المستخدم
az: Müxtəlif İİ düzəlişləri

source: New Models
ar: نماذج جديدة
az: Yeni Modellər

source: Translations
ar: الترجمات
az: Tərcümələr

source: These are all the available translations on 1.0.0, thanks to all the contributors!
ar: هذه هي جميع الترجمات المتوفرة في الإصدار 1.0.0، شكرًا لجميع المساهمين!
az: Bunlar 1.0.0 versiyasında mövcud olan bütün tərcümələrdir, bütün iştirakçılara təşəkkürlər!

source: Russian: Alex K
ar: الروسية: Alex K
az: Rus dili: Alex K

source: Spanish: Jeffser
ar: الإسبانية: Jeffser
az: İspan dili: Jeffser

source: Brazilian Portuguese: Daimar Stein
ar: البرتغالية البرازيلية: Daimar Stein
az: Braziliya Portuqalcası: Daimar Stein

source: French: Louis Chauvet-Villaret
ar: الفرنسية: Louis Chauvet-Villaret
az: Fransız dili: Louis Chauvet-Villaret

source: Norwegian: CounterFlow64
ar: النرويجية: CounterFlow64
az: Norveç dili: CounterFlow64

source: Bengali: Aritra Saha
ar: البنغالية: Aritra Saha
az: Benqal dili: Aritra Saha

source: Simplified Chinese: Yuehao Sui
ar: الصينية المبسطة: Yuehao Sui
az: Sadələşdirilmiş Çin dili: Yuehao Sui

source: Removed DOCX compatibility temporally due to error with python-lxml dependency
ar: إزالة توافقية DOCX مؤقتًا بسبب خطأ في الاعتمادية python-lxml
az: python-lxml asılılığı ilə bağlı xətaya görə DOCX uyğunluğu müvəqqəti olaraq qaldırıldı

source: Big Update
ar: تحديث كبير
az: Böyük Yeniləmə

source: Added compatibility for PDF
ar: إضافة التوافقية مع PDF
az: PDF üçün uyğunluq əlavə edildi

source: Added compatibility for DOCX
ar: إضافة التوافقية مع DOCX
az: DOCX üçün uyğunluq əlavə edildi

source: Merged 'file attachment' menu into one button
ar: دمج قائمة «إرفاق ملف» في زر واحد
az: 'fayl əlavəsi' menyusu bir düymədə birləşdirildi

source: Quick Fix
ar: إصلاح سريع
az: Sürətli Düzəliş

source: There were some errors when transitioning from the old version of chats to the new version. I apologize if this caused any corruption in your chat history. This should be the only time such a transition is needed.
ar: حدثت بعض الأخطاء عند الانتقال من الإصدار القديم للمحادثات إلى الإصدار الجديد. يعتذر المطور إذا تسبب ذلك في أي تلف في سجل محادثاتك. يجب أن تكون هذه هي المرة الوحيدة التي يلزم فيها مثل هذا الانتقال.
az: Söhbətlərin köhnə versiyasından yeni versiyaya keçid zamanı bəzi xətalar baş verdi. Əgər bu, söhbət tarixçənizdə hər hansı bir pozulmaya səbəb olubsa, üzr istəyirəm. Bu, belə bir keçidin lazım olduğu yeganə hal olmalıdır.

source: Huge Update
ar: تحديث ضخم
az: Nəhəng Yeniləmə

source: Added: Support for plain text files
ar: إضافة: دعم ملفات النص العادي
az: Əlavə edildi: Sadə mətn faylları üçün dəstək

source: Added: New backend system for storing messages
ar: إضافة: نظام خلفي جديد لتخزين الرسائل
az: Əlavə edildi: Mesajların saxlanması üçün yeni arxa plan sistemi

source: Added: Support for changing Ollama's overrides
ar: إضافة: دعم تغيير تجاوزات أولاما
az: Əlavə edildi: Ollama'nın üstünlüklərini dəyişmək üçün dəstək

source: General Optimization
ar: تحسين عام
az: Ümumi Optimizasiya

source: Added: Support for GGUF models (experimental)
ar: إضافة: دعم نماذج GGUF (تجريبي)
az: Əlavə edildi: GGUF modelləri üçün dəstək (eksperimental)

source: Added: Support for customization and creation of models
ar: إضافة: دعم تخصيص وإنشاء النماذج
az: Əlavə edildi: Modellərin fərdiləşdirilməsi və yaradılması üçün dəstək

source: Fixed: Icons don't appear on non Gnome systems
ar: إصلاح: الأيقونات لا تظهر على الأنظمة غير جنوم
az: Düzəldildi: İkonlar Gnome olmayan sistemlərdə görünmür

source: Update Ollama to v0.1.39
ar: تحديث أولاما إلى الإصدار v0.1.39
az: Ollama v0.1.39-a yeniləndi

source: Fixed: app didn't open if models tweaks wasn't present in the config files
ar: إصلاح: التطبيق لم يفتح إذا لم تكن تعديلات النماذج موجودة في ملفات التكوين
az: Düzəldildi: konfiqurasiya fayllarında model tənzimləmələri mövcud olmadıqda tətbiq açılmırdı

source: Changed multiple icons (paper airplane for the send button)
ar: تغيير أيقونات متعددة (طائرة ورقية لزر الإرسال)
az: Birdən çox ikona dəyişdirildi (göndər düyməsi üçün kağız təyyarə)

source: Combined export / import chat buttons into a menu
ar: دمج أزرار تصدير \ استيراد المحادثات في قائمة واحدة
az: Söhbət ixrac/idxal düymələri bir menyuda birləşdirildi

source: Added 'model tweaks' (temperature, seed, keep_alive)
ar: إضافة «تعديلات النموذج» (temperature, seed, keep_alive)
az: 'Model tənzimləmələri' əlavə edildi (temperatur, toxum, keep_alive)

source: Fixed send / stop button
ar: إصلاح زر الإرسال \ الإيقاف
az: Göndər/dayandır düyməsi düzəldildi

source: Fixed app not checking if remote connection works when starting
ar: إصلاح عدم تحقق التطبيق من عمل الاتصال عن بعد عند البدء
az: Tətbiqin başlanğıcda uzaqdan bağlantının işlədiyini yoxlamaması düzəldildi

source: Daily Update
ar: تحديث يومي
az: Gündəlik Yeniləmə

source: Added text ellipsis to chat name so it doesn't change the button width
ar: أُضيفت علامة حذف النص إلى اسم المحادثة كي لا يتغيّر عرض الزرّ.
az: Düymə enini dəyişdirməməsi üçün söhbət adına mətn ellipsisi əlavə edildi

source: New shortcut for creating a chat (CTRL+N)
ar: اختصار جديد لإنشاء محادثة (CTRL+N).
az: Söhbət yaratmaq üçün yeni qısayol (CTRL+N)

source: New message entry design
ar: تصميم جديد لمُدْخَل الرسائل
az: Yeni mesaj daxiletmə dizaynı

source: Fixed: Can't rename the same chat multiple times
ar: أُصلِح: تعذُّر إعادة تسمية المحادثة نفسها مرّاتٍ عديدة
az: Düzəldildi: Eyni söhbəti bir neçə dəfə adlandırmaq olmur

source: The fix
ar: الإصلاح
az: Düzəliş

source: Fixed: Ollama instance keeps running on the background even when it is disabled
ar: أُصلِح: استمرار تشغيل نسخة أولاما في الخلفيّة حتى عند تعطيلها
az: Düzəldildi: Ollama nüsxəsi deaktiv edildikdə belə arxa planda işləməyə davam edirdi

source: Fixed: Can't pull models on the integrated instance
ar: أُصلِح: تعذُّر جلب النماذج على النُسخة المُدمجة
az: Düzəldildi: İnteqrasiya olunmuş nüsxədə modelləri endirmək olmur

source: Quick tweaks
ar: تعديلاتٌ سريعةٌ
az: Sürətli tənzimləmələr

source: Added progress bar to models that are being pulled
ar: إضافة شريط تقدُّم للنماذج التي يجري جلبها
az: Endirilən modellərə tərəqqi çubuğu əlavə edildi

source: Added size to tags when pulling a model
ar: إضافة الحجم للوسوم عند جلب نموذج
az: Model endirərkən teqlərə ölçü əlavə edildi

source: General optimizations on the background
ar: تحسيناتٌ عامّةٌ في الخلفيّة.
az: Arxa planda ümumi optimallaşdırmalar

source: Quick fixes
ar: إصلاحاتٌ سريعةٌ
az: Sürətli düzəlişlər

source: Fixed: Scroll when message is received
ar: أُصلِح: التمرير عند استلام رسالة
az: Düzəldildi: Mesaj alındıqda sürüşdürmə

source: Fixed: Content doesn't change when creating a new chat
ar: أُصلِح: عدم تغيُّر المحتوى عند إنشاء محادثة جديدة
az: Düzəldildi: Yeni söhbət yaradıldıqda məzmun dəyişmir

source: Added 'Featured Models' page on welcome dialog
ar: إضافة صفحة «النماذج المختارة» في حواريَّة الترحيب
az: Xoş gəlmisiniz dialoquna 'Seçilmiş Modellər' səhifəsi əlavə edildi

source: Nice Update
ar: تحديثٌ جيّدٌ
az: Gözəl Yeniləmə

source: UI tweaks (Thanks Nokse22)
ar: تعديلاتٌ في واجهة المُستخدم (شُكرًا لـ Nokse22)
az: İİ düzəlişləri (Təşəkkürlər Nokse22)

source: Metadata fixes
ar: إصلاحاتٌ في البيانات الوصفيَّة
az: Metadata düzəlişləri

source: Quick fix
ar: إصلاحٌ سريعٌ
az: Sürətli düzəliş

source: Updated Spanish translation
ar: تحديث الترجمة الإسبانيَّة
az: İspan tərcüməsi yeniləndi

source: Added compatibility for PNG
ar: إضافة التوافقيّة مع صيغة PNG
az: PNG üçün uyğunluq əlavə edildi

source: New Update
ar: تحديث جديد
az: Yeni Yeniləmə

source: Added image recognition to more models
ar: إضافة ميزة التعرُّف على الصوَر للمزيد من النماذج
az: Daha çox modelə şəkil tanıma əlavə edildi

source: Added Brazilian Portuguese translation (Thanks Daimaar Stein)
ar: إضافة الترجمة البرتغاليَّة البرازيليَّة (شُكرًا لـ Daimaar Stein)
az: Braziliya Portuqalcası tərcüməsi əlavə edildi (Təşəkkürlər Daimaar Stein)

source: Refined the general UI (Thanks Nokse22)
ar: تحسين واجهة المُستخدم العامّة (شُكرًا لـ Nokse22)
az: Ümumi İİ təkmilləşdirildi (Təşəkkürlər Nokse22)

source: Added 'delete message' feature
ar: إضافة ميِّزة «حذف الرسالة»
az: 'mesajı sil' xüsusiyyəti əlavə edildi

source: Added metadata so that software distributors know that the app is compatible with mobile
ar: إضافة بيانات وصفيّة كي يعلم موزِّعو البرمجيَّات بأنّ التطبيق مُتوافقٌ مع الأجهزة المحمولة
az: Proqram təminatı distribyutorlarının tətbiqin mobil cihazlarla uyğun olduğunu bilməsi üçün metadata əlavə edildi

source: Changed 'send' shortcut to just the return/enter key (to add a new line use shift+return)
ar: تغيير اختصار «أرسِل» إلى مفتاح الإدخال فقط (لإضافة سطر جديد استخدِم Shift+Return)
az: 'göndər' qısayolu yalnız return/enter düyməsinə dəyişdirildi (yeni sətir əlavə etmək üçün shift+return istifadə edin)

source: Bug Fixes
ar: إصلاحات للأخطاء البرمجيَّة
az: Xəta Düzəlişləri

source: Fixed: Minor spelling mistake
ar: أُصلِح: خطأ إملائي بسيط
az: Düzəldildi: Kiçik orfoqrafik səhv

source: Added 'mobile' as a supported form factor
ar: إضافة «المحمول» كعامل شكلي مدعوم
az: 'mobil' dəstəklənən form-faktor olaraq əlavə edildi

source: Fixed: 'Connection Error' dialog not working properly
ar: أُصلِح: حواريَّة «خطأ في الاتّصال» لا تعمل بشكل صحيح
az: Düzəldildi: 'Bağlantı Xətası' dialoqu düzgün işləmir

source: Fixed: App might freeze randomly on startup
ar: أُصلِح: احتمال تجمُّد التطبيق عشوائيًّا عند البدء
az: Düzəldildi: Tətbiq başlanğıcda təsadüfi olaraq donurdu

source: Changed 'chats' label on sidebar for 'Alpaca'
ar: تغيير تسمية «المحادثات» في الشريط الجانبي إلى «الألبكة».
az: Yan paneldəki 'söhbətlər' etiketi 'Alpaca' olaraq dəyişdirildi

source: Cool Update
ar: تحديث رائع
az: Əla Yeniləmə

source: Better design for chat window
ar: تصميم أفضل لنافذة المحادثة
az: Söhbət pəncərəsi üçün daha yaxşı dizayn

source: Better design for chat sidebar
ar: تصميم أفضل للشريط الجانبي للمحادثة
az: Söhbət yan paneli üçün daha yaxşı dizayn

source: Fixed remote connections
ar: إصلاح الاتِّصالات عن بُعد
az: Uzaqdan bağlantılar düzəldildi

source: Fixed Ollama restarting in loop
ar: إصلاح مشكلة إعادة تشغيل أولاما المُتكرِّرة
az: Ollama-nın dövri olaraq yenidən başlaması düzəldildi

source: Other cool backend stuff
ar: تحسينات رائعة أُخرى في البُنية التحتيَّة
az: Digər əla arxa plan işləri

source: Added Ollama as part of Alpaca, Ollama will run in a sandbox
ar: إضافة أولاما كجُزء من «الألبكة»، حيث ستعمل في بيئة معزولة
az: Ollama, Alpaca-nın bir hissəsi olaraq əlavə edildi, Ollama sandbox-da işləyəcək

source: Added option to connect to remote instances (how it worked before)
ar: إضافة خيار للاتِّصال بنُسَخ عن بُعد (كما كان يعمل سابقًا).
az: Uzaqdakı nüsxələrə qoşulma seçimi əlavə edildi (əvvəlki kimi)

source: Added option to import and export chats
ar: إضافة خيار لاستيراد وتصدير المحادثات
az: Söhbətləri idxal və ixrac etmək üçün seçim əlavə edildi

source: Added option to run Alpaca with Ollama in the background
ar: إضافة خيار لتشغيل «الألبكة» مع أولاما في الخلفيَّة
az: Alpaca-nı arxa planda Ollama ilə işə salmaq üçün seçim əlavə edildi

source: Added preferences dialog
ar: إضافة حواريَّة التفضيلات
az: Tərcihlər dialoqu əlavə edildi

source: Changed the welcome dialog
ar: تغيير حواريَّة الترحيب
az: Xoş gəlmisiniz dialoqu dəyişdirildi

source: Please report any errors to the issues page, thank you.
ar: يُرجى الإبلاغ عن أيّ أخطاء تواجهكم في صفحة المشاكل، وشُكرًا لكم.
az: Zəhmət olmasa, hər hansı bir xətanı problemlər səhifəsinə bildirin, təşəkkürlər.

source: Yet Another Daily Update
ar: تحديثٌ يومي آخر
az: Daha Bir Gündəlik Yeniləmə

source: Added better UI for 'Manage Models' dialog
ar: إضافة واجهة مُستخدم أفضل لحواريَّة «أدِر النماذج»
az: 'Modelləri İdarə Et' dialoqu üçün daha yaxşı İİ əlavə edildi

source: Added better UI for the chat sidebar
ar: إضافة واجهة مُستخدم أفضل للشريط الجانبي للمحادثة
az: Söhbət yan paneli üçün daha yaxşı İİ əlavə edildi

source: Replaced model description with a button to open Ollama's website for the model
ar: استبدال وصف النموذج بزر يفتح موقع أولاما الخاص بالنموذج
az: Model təsviri, model üçün Ollama-nın veb saytını açan bir düymə ilə əvəz edildi

source: Added myself to the credits as the spanish translator
ar: إضافة اسمي إلى قائمة الشُكر والتقدير بصفتي المُترجم الإسباني
az: Özümü ispan tərcüməçisi kimi təşəkkürlər bölməsinə əlavə etdim

source: Using XDG properly to get config folder
ar: استخدام XDG بشكلٍ صحيح للحصول على مُجلَّد الضبط (config)
az: Konfiqurasiya qovluğunu əldə etmək üçün XDG-dən düzgün istifadə

source: Update for translations
ar: تحديث للترجمات
az: Tərcümələr üçün yeniləmə

source: The last update had some mistakes in the description of the update
ar: التحديث الأخير تضمَّن بعض الأخطاء في وصفه
az: Son yeniləmənin təsvirində bəzi səhvlər var idi

source: Another Daily Update
ar: تحديث يومي آخر
az: Daha Bir Gündəlik Yeniləmə

source: Added full Spanish translation
ar: إضافة الترجمة الإسبانيَّة كاملة
az: Tam İspan tərcüməsi əlavə edildi

source: Added support for background pulling of multiple models
ar: إضافة دعم جلب نماذج مُتعدِّدة في الخلفية
az: Arxa planda birdən çox modelin endirilməsi üçün dəstək əlavə edildi

source: Added interrupt button
ar: إضافة زر المقاطعة
az: Fasilə düyməsi əlavə edildi

source: Added basic shortcuts
ar: إضافة اختصارات أساسيَّة
az: Əsas qısayollar əlavə edildi

source: Better translation support
ar: دعم أفضل للترجمة
az: Daha yaxşı tərcümə dəstəyi
